{
  "id": 1034,
  "name": "PT. Komunika Cipta Performa",
  "description": "With a strong focus on sales, leadership, communication, and coaching, we have been empowering individuals and organizations to unlock their full potential for the past five years. Our comprehensive training modules and experienced trainers ensure that our clients gain the necessary skills and knowledge to excel in today's competitive business landscape.",
  "features": [
    "Offer On site training",
    "CONSULTATIVE SELLING SKILLS",
    "SEMANTIC COMMUNICATION SKILLS"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Build a More Diverse and Inclusive Workforce",
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Learning and Development"
  ],
  "sub_categories": [
    "Corporate LMS",
    "Training & development companies"
  ],
  "tags": [
    "Diversity and inclusion",
    "Learning analytics"
  ],
  "headquarter": "Indonesia",
  "launch_date": "2018",
  "order": 20977,
  "weightage": false,
  "HCM": null,
  "Headline": "Accelerating performance through mastering interpersonal skills.",
  "ProductId": null,
  "ShortDescription": "PT. Komunika CIpta Performa is a premier training company specializing in delivering high-quality soft-skills training programs to professionals across various industries",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [
    {
      "name": "Leadership Coaching Services:",
      "sequence": 0,
      "description": "The website title \"Leaders as Coach\" suggests the site offers coaching services specifically targeted towards leaders. This could involve helping them develop their leadership skills, communication styles, and overall effectiveness."
    },
    {
      "name": "Focus on Coaching Approach",
      "sequence": 1,
      "description": "The term \"coach\" implies a collaborative and personalized approach to development. Leaders as Coach might emphasize building self-awareness, setting goals, and providing ongoing support to help leaders achieve their full potential."
    },
    {
      "name": "Developed by a Leader or Coach:",
      "sequence": 2,
      "description": "While creator information might not be readily available, the focus on leadership coaching suggests the website is run by someone with experience in leadership development or coaching itself. This could lend credibility to the offered services."
    }
  ],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": true,
  "Large_Enterprise": true,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:39:14.125Z",
  "enhanced_description": "PT. Komunika Cipta Performa is a premier training company specializing in delivering high-quality soft-skills training programs to professionals across various industries. With over five years of experience (since 2018), they focus on accelerating performance by mastering interpersonal skills, including sales, leadership, communication, and coaching. They empower individuals and organizations to unlock their full potential, offering comprehensive training modules delivered by experienced trainers, including on-site training. Their services extend to dedicated leadership coaching, emphasizing a collaborative and personalized approach to help leaders develop skills, improve communication, and achieve their full effectiveness. The company aims to help clients gain the necessary skills and knowledge to excel in today's competitive business landscape.",
  "target_industries": [
    "Cross-industry"
  ],
  "ideal_company_sizes": [
    "Large Enterprise",
    "Global Enterprise"
  ],
  "key_use_cases": [
    "Improving sales team performance through consultative selling skills",
    "Developing effective leadership capabilities and fostering a coaching culture",
    "Enhancing internal and external communication skills (semantic communication)",
    "Accelerating overall skill development and learning efficiency within an organization",
    "Building a more diverse and inclusive workforce through targeted training",
    "Providing on-site soft-skills training and leadership coaching services"
  ],
  "competitive_advantages": [
    "Strong focus on key soft skills: sales, leadership, communication, and coaching",
    "Five years of established experience in empowering individuals and organizations",
    "Comprehensive training modules delivered by experienced trainers",
    "Specialization in high-quality soft-skills training programs",
    "Offering convenient on-site training solutions",
    "Dedicated leadership coaching services with a personalized approach"
  ],
  "implementation_scenarios": [
    "On-site training delivery at client locations"
  ],
  "hr_functions_supported": [
    "Learning and Development",
    "Training and Development",
    "Diversity and Inclusion"
  ],
  "roi_benefits": [
    "Unlocking full potential for individuals and organizations",
    "Gaining necessary skills and knowledge to excel in competitive business landscapes",
    "Accelerating skill development and learning efficiency",
    "Accelerating overall performance through mastering interpersonal skills",
    "Helping leaders achieve their full potential",
    "Contribution to building a more diverse and inclusive workforce"
  ],
  "searchable_keywords": [
    "PT Komunika Cipta Performa",
    "training company",
    "soft skills training",
    "sales training",
    "consultative selling skills",
    "leadership training",
    "leadership coaching",
    "communication skills training",
    "semantic communication skills",
    "coaching services",
    "on-site training",
    "corporate training",
    "professional development",
    "skill development",
    "learning and development",
    "diversity and inclusion",
    "learning analytics",
    "interpersonal skills",
    "performance acceleration",
    "Indonesia"
  ],
  "primary_users": [
    "Individuals seeking skill enhancement",
    "Professionals across various industries",
    "Organizational leaders",
    "HR departments",
    "Learning and Development (L&D) professionals"
  ],
  "deployment_options": [
    "On-site"
  ],
  "_weight": 1
}