{
  "id": 1101,
  "name": "Scripbox",
  "description": "Founded in 2012, Scripbox understands the needs of customers in the context of their life and wealth stages, and provides customised investment solutions to help them meet their financial goals. It uses data, technology, and proprietary algorithms to deliver a full stack of wealth management solutions ranging from mutual funds, Indian and International equities, and insurance to holistic portfolio construction and financial advisory. Scripbox is led by Atul Shinghal (Founder and CEO), and Sanjiv Singhal (Founder and Chief Operating Officer). It has been recognised as the 2nd most influential financial services brand globally by LinkedIn and has received the Financial Express’ Best Bank Award.",
  "features": [
    "Working with us makes you great at managing money.   ",
    "You will work on what you really want to and love to.",
    " Your compensation will be fair and market based."
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement"
  ],
  "categories": [
    "Total Rewards"
  ],
  "sub_categories": [
    "Corporate wellness software",
    "Compensation management software"
  ],
  "tags": [
    "Employee benefits",
    "Employee recognition",
    "Employee happiness programs"
  ],
  "headquarter": "Bengaluru, Karnataka",
  "launch_date": "2012",
  "order": 21044,
  "weightage": null,
  "HCM": null,
  "Headline": "Helping people worry less about money since 2012.",
  "ProductId": null,
  "ShortDescription": "Founded in 2012, Scripbox understands the needs of customers in the context of their life and wealth stages, and provides customised investment solutions to help them meet their financial goals.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:40:34.845Z",
  "enhanced_description": "Scripbox, founded in 2012, is a financial technology company that provides customized investment and wealth management solutions. Leveraging data, technology, and proprietary algorithms, it offers a full suite of services including mutual funds, Indian and International equities, insurance, holistic portfolio construction, and financial advisory. Within the HR technology landscape, Scripbox applies its expertise to offer these wealth management and financial wellness solutions as part of an organization's total rewards and corporate wellness programs. The product aims to help employees achieve their financial goals, thereby improving overall employee happiness and engagement by alleviating financial concerns.",
  "key_use_cases": [
    "Providing customized investment solutions to employees as a benefit",
    "Offering comprehensive wealth management services (mutual funds, equities, insurance, financial advisory) to employees",
    "Supporting corporate wellness initiatives with a focus on financial well-being",
    "Integrating financial planning and advisory into total rewards strategies",
    "Enhancing employee happiness and engagement by addressing financial goals and reducing money-related stress"
  ],
  "competitive_advantages": [
    "Uses data, technology, and proprietary algorithms to deliver solutions",
    "Provides customized investment solutions based on life and wealth stages",
    "Offers a full stack of wealth management solutions (mutual funds, Indian and International equities, insurance, holistic portfolio construction, financial advisory)",
    "Recognized as a leading financial services brand (2nd most influential globally by LinkedIn, Financial Express' Best Bank Award)"
  ],
  "hr_functions_supported": [
    "Total Rewards Management (specifically financial benefits and wellness)",
    "Corporate Wellness",
    "Employee Engagement",
    "Compensation Management (in the context of integrating financial planning with overall employee compensation)"
  ],
  "roi_benefits": [
    "Improved Employee Happiness and Engagement",
    "Reduced employee financial worry and stress",
    "Enhanced employee financial literacy and money management skills"
  ],
  "searchable_keywords": [
    "Scripbox",
    "wealth management",
    "financial planning",
    "investment solutions",
    "mutual funds",
    "equities",
    "insurance",
    "financial advisory",
    "corporate wellness",
    "employee benefits",
    "total rewards",
    "compensation management",
    "employee happiness programs",
    "employee recognition",
    "financial well-being",
    "financial wellness"
  ],
  "primary_users": [
    "Employees (as recipients of financial advice and investment services)",
    "HR Professionals (who administer and manage employee benefits and corporate wellness programs)"
  ],
  "_weight": 1
}