{
  "id": 1109,
  "name": "SEE YOURSELF GROW",
  "description": "As a person who has been in the corporate world for 20 years, Tina knows what it means to climb the corporate ladder, work crazy long hours, commute to work 4 hours a day and miss out on precious moments with my family. January 2019 she had a breakdown in the office, which then lead her to her greatest breakthrough that it was time to focus on achieving her perfect day, instead of chasing after the perfect corporate title. Tina Collura has been coaching and motivating people to live their purpose, achieve balance and focus on all that is good in their lives since 2009. If you can wake up every morning and say to yourself that you are in love with what you are doing - then CONGRATULATIONS! You are part of the 20% of people in this world that are doing what they love!\n However, if you are not part of that 20%, then I want to talk to you about how you can get there.",
  "features": [
    "Personal and Professional Coaching  ",
    "Productivity Coaching",
    "Motivational Speaker"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Learning and Development"
  ],
  "sub_categories": [
    "Corporate LMS",
    "Course authoring",
    "Training eLearning software"
  ],
  "tags": [
    "Skill development",
    "Skill acquisition",
    "Adaptive learning"
  ],
  "headquarter": "Toronto, Ontario",
  "launch_date": "2009",
  "order": 21052,
  "weightage": null,
  "HCM": null,
  "Headline": "Are you ready to LEVEL UP in your BUSINESS?",
  "ProductId": null,
  "ShortDescription": "As a person who has been in the corporate world for 20 years, Tina knows what it means to climb the corporate ladder, work crazy long hours, commute to work 4 hours a day and miss out on precious moments with my family.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:40:44.633Z",
  "enhanced_description": "SEE YOURSELF GROW offers personalized coaching services led by Tina Collura, a professional with 20 years of experience in the corporate world. Drawing from her own journey of transitioning from a demanding corporate career, Tina provides personal, professional, and productivity coaching. Launched in 2009, this service aims to help individuals, especially those feeling unfulfilled in their current roles, to 'LEVEL UP in their BUSINESS.' The focus is on achieving personal purpose, work-life balance, and overall well-being, rather than solely chasing corporate titles. Additionally, Tina serves as a motivational speaker, supporting accelerated skill development and learning efficiency.",
  "key_use_cases": [
    "Career transition and pathfinding for corporate professionals",
    "Improving work-life balance and personal fulfillment",
    "Enhancing individual productivity",
    "Developing personal and professional skills",
    "Providing motivational speaking engagements for organizations",
    "Accelerating skill development and learning efficiency within a corporate context"
  ],
  "competitive_advantages": [
    "Founder's extensive corporate background (20 years) provides relatable experience and empathy",
    "Focus on holistic personal and professional growth, including purpose and balance, beyond just career advancement",
    "Proven track record of coaching and motivating individuals since 2009"
  ],
  "hr_functions_supported": [
    "Learning and Development",
    "Employee Well-being",
    "Employee Engagement"
  ],
  "roi_benefits": [
    "Improved individual productivity",
    "Enhanced personal and professional skill development",
    "Greater employee fulfillment and purpose",
    "Better work-life balance for individuals",
    "Potential for increased employee retention (implied by fostering fulfillment)"
  ],
  "searchable_keywords": [
    "SEE YOURSELF GROW",
    "Personal Coaching",
    "Professional Coaching",
    "Productivity Coaching",
    "Motivational Speaker",
    "Coaching Services",
    "Skill Development",
    "Learning Efficiency",
    "Learning and Development",
    "Skill Acquisition",
    "Adaptive Learning",
    "Career Coaching",
    "Work-Life Balance",
    "Purpose-driven Coaching",
    "Corporate Coaching",
    "Professional Growth",
    "Leadership Development",
    "Employee Development",
    "Corporate LMS",
    "Course Authoring",
    "Training eLearning Software"
  ],
  "primary_users": [
    "Individuals seeking personal and professional growth in their careers",
    "Professionals looking for career transition or purpose",
    "Employees aiming to enhance productivity and achieve better work-life balance",
    "Organizations or companies seeking motivational speakers for their staff development programs"
  ],
  "_weight": 1
}