{
  "id": 1287,
  "name": "Masters union",
  "description": "Masters’ Union is a next-generation non-conventional business school established in the year 2020 in Gurugram, Haryana. Masters’ Union is amongst the topmost business schools in the country with a record-breaking placement record over the years.",
  "features": [
    "Masters’ Union offers a 4-year Undergraduate Programme in Technology and Business Management and a 16-month Postgraduate Programme in Technology and Business Management.",
    "The programs offered by Master's Union are taught by CXOs, MDs, eminent public leaders, and even Members of Parliament, apart from distinguished global faculty from top B-schools who regularly consult with Fortune 500 companies."
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Learning and Development"
  ],
  "sub_categories": [
    "Training & development companies"
  ],
  "tags": [
    "Skill development",
    "Learning efficiency",
    "Training effectiveness",
    "Skill acquisition",
    "Learning optimisation",
    "Training methodologies",
    "Adaptive learning",
    "Personalised learning",
    "Learning analytics",
    "Learning retention",
    "Continuous learning"
  ],
  "headquarter": "Delhi, New Delhi",
  "launch_date": "2020",
  "order": 21113,
  "weightage": true,
  "HCM": null,
  "Headline": "A unique practitioner-led higher education institution, where courses are taught by CXOs from Morgan Stanley, Tata, StanChart, Google, Twitter, Reliance, Razorpay, etc. Our recruiters include Mckinsey, BCG, Bain, Softbank",
  "ProductId": null,
  "ShortDescription": "A technology-focused business school led by veteran leaders who are rethinking business education from the ground up.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-03-05T11:14:05.404Z",
  "enhanced_description": "Masters' Union is a next-generation, non-conventional business school established in 2020 in Gurugram, Haryana. It focuses on rethinking business education from the ground up, offering a 4-year Undergraduate Programme and a 16-month Postgraduate Programme in Technology and Business Management. A unique practitioner-led institution, its courses are taught by CXOs, MDs, eminent public leaders, and global faculty who consult with Fortune 500 companies. Masters' Union is recognized as a top business school in the country, boasting a record-breaking placement record with recruiters including Mckinsey, BCG, Bain, and Softbank.",
  "key_use_cases": [
    "Providing higher education programs focused on technology and business management",
    "Accelerating skill development and learning efficiency for aspiring professionals",
    "Developing a pipeline of industry-ready talent for companies",
    "Facilitating career progression through practitioner-led education"
  ],
  "competitive_advantages": [
    "Practitioner-led education from CXOs, MDs, eminent public leaders, and Members of Parliament",
    "Technology-focused curriculum and programs",
    "Non-conventional and next-generation approach to business education",
    "Record-breaking placement record with top-tier recruiters",
    "Distinguished global faculty with industry consulting experience"
  ],
  "hr_functions_supported": [
    "Learning & Development (as a training and talent development provider)",
    "Talent Acquisition (as a source of skilled candidates)"
  ],
  "roi_benefits": [
    "Enhanced skill acquisition and retention for participants",
    "Improved learning efficiency through practitioner-led and non-conventional methodologies",
    "Access to a talent pool with practical, industry-relevant skills for recruiting organizations"
  ],
  "searchable_keywords": [
    "Masters union",
    "business school",
    "technology management",
    "business management",
    "postgraduate program",
    "undergraduate program",
    "CXO-led learning",
    "practitioner-led education",
    "skill development",
    "learning efficiency",
    "training effectiveness",
    "skill acquisition",
    "learning optimisation",
    "training methodologies",
    "adaptive learning",
    "personalised learning",
    "learning analytics",
    "learning retention",
    "continuous learning",
    "higher education",
    "Gurugram",
    "India",
    "talent development",
    "executive education",
    "tech business school",
    "management education"
  ],
  "primary_users": [
    "Undergraduate and postgraduate students seeking careers in technology and business management",
    "Companies and organizations seeking to recruit skilled professionals in technology and business"
  ],
  "_weight": 1
}