{
  "id": 372,
  "name": "100sClub",
  "description": "What is 100sClub? It aims to bring together Turkey's companies that support youth employment with young talents. Companies are listed in the guidebook and mobile application. Special internships, job opportunities, career development and training opportunities are introduced to young talents. With a 360-degree service approach, participating employer brands have many opportunities to introduce themselves to young talents and interact with them. The guide, published annually, includes a limited number of companies from each sector, and only 100 companies are included in this exclusive club.",
  "features": [
    "Visibility in business magazines through book promotion.",
    "Innovative perception with 100sClub mobile application",
    "Participation in online events special for young talents"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Hire Top Talent Faster and More Efficiently",
    "Boost Hiring Manager Confidence and Productivity"
  ],
  "categories": [
    "Recruiting",
    "Talent Management"
  ],
  "sub_categories": [
    "Employee engagement software",
    "Talent acquisition suites"
  ],
  "tags": [
    "Recruiting",
    "Hiring",
    "Talent sourcing",
    "Recruiting costs",
    ""
  ],
  "headquarter": "",
  "launch_date": "2021",
  "order": 20333,
  "weightage": null,
  "HCM": null,
  "Headline": "Turkey's Companies Supporting Youth Employment",
  "ProductId": null,
  "ShortDescription": "100sClub bring together the 100 companies that first come to mind when it comes to youth employment in Turkey, with young talents pursuing their careers!",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": [],
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": false,
  "Most_Searched": true,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:25:32.259Z",
  "enhanced_description": "100sClub is an exclusive HR platform launched in 2021, focused on connecting Turkey's leading companies committed to youth employment with young talents. Operating with a 360-degree service approach, it aims to help participating employer brands introduce themselves to young talents, streamline the hiring of top talent, and boost hiring manager confidence and productivity. The platform offers special internships, job opportunities, career development, and training opportunities to young talents. Member companies gain significant visibility through an annually published guidebook, a dedicated 100sClub mobile application, and promotion in business magazines. Additionally, participating companies can interact directly with young talents through exclusive online events, enhancing their innovative employer brand perception.",
  "key_use_cases": [
    "Facilitating youth employment and recruitment",
    "Connecting companies with young talent for internships and job opportunities",
    "Providing career development and training opportunities for young talents",
    "Enhancing employer brand visibility and perception among young talents",
    "Efficient talent acquisition for entry-level and youth-focused roles"
  ],
  "competitive_advantages": [
    "Exclusivity: Limited to 100 leading companies in Turkey, creating a prestigious club.",
    "Comprehensive 360-degree service approach for employer branding and talent engagement.",
    "Unique visibility channels: Annual guidebook, mobile application, and business magazine promotion.",
    "Direct interaction opportunities through special online events.",
    "Niche focus on youth employment in Turkey, providing a targeted talent pool."
  ],
  "hr_functions_supported": [
    "Recruiting",
    "Talent Acquisition",
    "Employer Branding",
    "Talent Sourcing",
    "Candidate Relationship Management (implied through interaction features)",
    "Career Development (for candidates)",
    "Training & Development (for candidates)"
  ],
  "roi_benefits": [
    "Faster and more efficient hiring of top youth talent.",
    "Increased hiring manager confidence and productivity.",
    "Enhanced employer brand recognition and positive perception among young talents.",
    "Access to an exclusive and targeted pool of young talent."
  ],
  "searchable_keywords": [
    "youth employment Turkey",
    "young talent acquisition",
    "Turkey recruitment",
    "internship opportunities Turkey",
    "career development for youth",
    "employer branding Turkey",
    "talent sourcing Turkey",
    "recruiting platform Turkey",
    "100sClub",
    "job opportunities Turkey",
    "talent management Turkey",
    "HR technology Turkey",
    "youth hiring"
  ],
  "primary_users": [
    "HR Professionals (specifically Recruiting Teams)",
    "Hiring Managers",
    "Young Talents (Job Seekers, Internship Candidates)"
  ],
  "deployment_options": [
    "Mobile Application",
    "Annual Guidebook (Print/Digital Publication)"
  ],
  "_weight": 1
}