{
  "id": 376,
  "name": "99 Jobs",
  "description": "99jobs exists to change the world by helping people do what they love. We are an HRTech made by and for people worried about the sameness of the job market, which idealizes and develops creative solutions for experiences in Recruitment and Selection processes, always looking at three pillars: technology, creativity and inclusion. Everything we do aims to promote an inclusive culture and a match of values. After all, we believe that everyone can do what they love as they are - and that cannot be a privilege. DISCOVER OUR UNIVERSE: For candidates 99jobs.com Our search platform brings together thousands of open positions in companies from different sectors and segments throughout Brazil. A community that brings together thousands of people worried about the sameness of the job market.",
  "features": [
    "digitize your HR Nativeland Consulting for recruitment and Employer Branding processes, in addition to providing training and development in Social Reparation and Inclusive Culture.",
    "Our ATS system (Application Tracking System) that facilitates the management of Recruitment and Selection processes and enables centralized data management, contributing to a more digital HR and generating agility and metrics for companies' recruitment efforts",
    "develops creative solutions for experiences"
  ],
  "founders": [
    "Pradnya Poojary"
  ],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement",
    "Boost Hiring Manager Confidence and Productivity",
    "Fill Open Positions More Quickly"
  ],
  "categories": [
    "Recruiting",
    "Talent Management",
    "Total Rewards"
  ],
  "sub_categories": [
    "Recruiting software",
    "Recruitment agencies",
    "Recruiting automation software",
    "Employee recognition software",
    "Career management software"
  ],
  "tags": [
    "Employee empowerment",
    "Employee engagement",
    "Recruiting",
    "Data-driven hiring",
    ""
  ],
  "headquarter": "",
  "launch_date": "2013",
  "order": 20337,
  "weightage": null,
  "HCM": null,
  "Headline": "Find opportunities to #DoWhatYouLove",
  "ProductId": null,
  "ShortDescription": "99jobs exists to change the world by helping people do what they love. We are an HRTech made by and for people worried about the sameness of the job market, which idealizes and develops creative solutions for experiences in Recruitment and Selection processes, always looking at three pillars: technology, creativity and inclusion",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": [],
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": false,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:25:39.251Z",
  "enhanced_description": "99jobs is an HRTech platform dedicated to transforming the job market by helping individuals pursue their passions. It offers creative and inclusive solutions for Recruitment and Selection processes, focusing on technology, creativity, and inclusion to promote an inclusive culture and ensure a match of values. The platform includes a search portal for candidates, bringing together thousands of open positions across various sectors and segments throughout Brazil. For companies, 99jobs provides an ATS (Application Tracking System) for streamlined recruitment and selection management, centralized data management, and generating valuable metrics for recruitment efforts. Additionally, it offers HR Nativeland Consulting for recruitment and Employer Branding, alongside training and development programs focused on Social Reparation and Inclusive Culture.",
  "target_industries": [],
  "ideal_company_sizes": [],
  "key_use_cases": [
    "Recruitment process management",
    "Selection process management",
    "Employer Branding development",
    "Training and development in Social Reparation and Inclusive Culture",
    "Centralized data management for recruitment and selection processes",
    "Candidate job search and application"
  ],
  "competitive_advantages": [
    "Strong focus on technology, creativity, and inclusion in HR processes",
    "Aims to promote an inclusive culture and a match of values in hiring",
    "Develops creative solutions for experiences in Recruitment and Selection",
    "Offers HR Nativeland Consulting for recruitment and Employer Branding",
    "Provides specialized training and development in Social Reparation and Inclusive Culture",
    "ATS system facilitates centralized data management, agility, and metrics for recruitment"
  ],
  "hr_functions_supported": [
    "Recruiting",
    "Selection",
    "Employer Branding",
    "Talent Development (specifically for Social Reparation and Inclusive Culture)",
    "HR Data Management (for Recruitment and Selection)",
    "Talent Management",
    "Employee Recognition"
  ],
  "technology_stack": [
    "Application Tracking System (ATS)"
  ],
  "integration_capabilities": [],
  "roi_benefits": [
    "Improved employee happiness and engagement",
    "Boosted hiring manager confidence and productivity",
    "Faster filling of open positions",
    "More digital HR processes",
    "Increased agility in recruitment efforts",
    "Generation of metrics for recruitment efforts",
    "Promotion of an inclusive organizational culture",
    "Better match of values between candidates and companies"
  ],
  "searchable_keywords": [
    "99 Jobs",
    "HRTech",
    "Recruitment",
    "Selection",
    "ATS",
    "Application Tracking System",
    "Employer Branding",
    "Inclusive Culture",
    "Social Reparation",
    "Talent Management",
    "Employee Happiness",
    "Employee Engagement",
    "Hiring Manager Productivity",
    "Data-driven hiring",
    "Career Management",
    "Recruiting Software",
    "Recruitment Agencies",
    "Recruitment Automation",
    "Employee Empowerment",
    "Brazil job market"
  ],
  "primary_users": [
    "HR Professionals (Recruiters, HR Managers)",
    "Hiring Managers",
    "Candidates"
  ],
  "deployment_options": [],
  "_weight": 1
}