{
  "id": 472,
  "name": "Careers In Motion Pte. Ltd.",
  "description": "Founded in 2013 by Geraldine Coquelle, whose background spans three decades of work experience across Asia Pacific, Middle East, and Africa, Careers In Motion is a privately held executive search company based in Singapore. We are a team of dedicated recruitment professionals that works with clients and candidates in Asia-Pacific, across a wide range of roles in market research and related industries. We believe in mutually beneficial relationships, the alchemy of common interests, and aligned expectations that results in long associations between candidates and employers. Our first aim is to ensure the potential of a match for a long and fulfilling relationship. But we also believe in change, and in the power of a well-timed and methodical change to pull you out of a rut and turbocharge your career. We also believe that not all journeys in job-seeking are the same, hence we tailor our process to circumstances and requirements on either side of the negotiating table. We are in the business of people at work, and in making sure they thrive wherever they plant themselves.",
  "features": [
    "Quantitative Research",
    "Consumer and Shopper Insights",
    "Retailer Services"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement"
  ],
  "categories": [
    "Talent Management"
  ],
  "sub_categories": [
    "Career management software",
    "Employee engagement software"
  ],
  "tags": [
    "Employee satisfaction",
    "Employee Engagement strategies"
  ],
  "headquarter": "Singapore, SG",
  "launch_date": "2013",
  "order": 20432,
  "weightage": null,
  "HCM": null,
  "Headline": "Jobs are short, careers last longer. Convert jobs into a career",
  "ProductId": null,
  "ShortDescription": "Careers In Motion is a privately held executive search company represented in Singapore and in the Philippines.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": [],
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": false,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:28:03.838Z",
  "enhanced_description": "Careers In Motion Pte. Ltd. is a privately held executive search company, founded in 2013 by Geraldine Coquelle, with a presence in Singapore and the Philippines. Leveraging Ms. Coquelle's three decades of experience across Asia Pacific, Middle East, and Africa, the company specializes in connecting clients and candidates within the market research and related industries throughout Asia-Pacific. Their team of dedicated recruitment professionals focuses on fostering long-term, mutually beneficial relationships, aiming to ensure a strong match for fulfilling career paths rather than just short-term jobs. Careers In Motion tailors its executive search process to individual circumstances and requirements, committed to helping individuals thrive in their careers and assisting employers in building engaged and satisfied teams.",
  "target_industries": [
    "Market Research",
    "Consumer Goods",
    "Retail"
  ],
  "key_use_cases": [
    "Executive Search",
    "Specialized Recruitment (Market Research and related industries)",
    "Talent Placement (long-term fit focus)",
    "Career Transition Support",
    "Strategic Talent Acquisition"
  ],
  "competitive_advantages": [
    "Specialized industry focus (Market Research and related industries)",
    "Founder's extensive regional experience (30 years across Asia Pacific, Middle East, Africa)",
    "Focus on long-term candidate-employer relationships",
    "Tailored recruitment process",
    "Asia-Pacific regional presence (Singapore, Philippines)"
  ],
  "hr_functions_supported": [
    "Recruitment",
    "Executive Search",
    "Talent Acquisition",
    "Career Management",
    "Employee Engagement"
  ],
  "roi_benefits": [
    "Improved candidate-employer fit leading to higher retention",
    "Access to specialized talent within market research and related industries",
    "Enhanced employee engagement and happiness",
    "Reduced turnover costs",
    "More fulfilling career paths for placed candidates"
  ],
  "searchable_keywords": [
    "Careers In Motion",
    "executive search",
    "recruitment",
    "talent acquisition",
    "market research",
    "consumer insights",
    "quantitative research",
    "retailer services",
    "Singapore",
    "Philippines",
    "Asia Pacific",
    "career management",
    "employee engagement",
    "talent management",
    "career development",
    "job search",
    "recruitment agency",
    "specialized recruitment",
    "employee satisfaction"
  ],
  "primary_users": [
    "HR Professionals",
    "Hiring Managers",
    "Business Leaders",
    "Job Seekers",
    "Candidates"
  ],
  "_weight": 1
}