{
  "id": 478,
  "name": "CecureUs",
  "description": "Viji Hari, founder CecureUs, has authored the book, Behind Closed. Cubicles(BCC) and Break the Taboo to increase awareness on the prevention of sexual harassment and holistic employee wellness.\n She has worked with several corporates, devised several training programs, and delivered safe and secure workplaces with Diversity and Inclusion across organizational levels. She has served as an external member of several POSH committees and helps organizations comply with Sexual Harassment Laws.",
  "features": [
    "Employee Awareness Training",
    "Training for committee",
    "3rd party empanelment"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement"
  ],
  "categories": [
    "Talent Management"
  ],
  "sub_categories": [
    "Workforce management",
    "Time tracking"
  ],
  "tags": [],
  "headquarter": "Chennai, Tamilnadu",
  "launch_date": "2000",
  "order": 20438,
  "weightage": null,
  "HCM": null,
  "Headline": "Creating Secure and Harmonious Workplaces",
  "ProductId": null,
  "ShortDescription": "For a workplace that allows an individual the space to be fearless, confident, secure and harmonious",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": [],
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": false,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:28:12.327Z",
  "enhanced_description": "CecureUs, founded by Viji Hari, is dedicated to creating secure and harmonious workplaces where individuals can be fearless, confident, and secure. The service focuses on the prevention of sexual harassment and holistic employee wellness, drawing on expertise from authored books like 'Behind Closed Cubicles' and 'Break the Taboo'. CecureUs devises and delivers training programs for employee awareness and committee members, provides 3rd party empanelment, and serves as an external member of POSH (Prevention of Sexual Harassment) committees to help organizations comply with relevant Sexual Harassment Laws and foster Diversity and Inclusion across all organizational levels.",
  "key_use_cases": [
    "Delivering employee awareness training on sexual harassment prevention",
    "Providing training for internal POSH (Prevention of Sexual Harassment) committees",
    "Offering 3rd party empanelment for POSH committees",
    "Assisting organizations with compliance to Sexual Harassment Laws",
    "Promoting Diversity and Inclusion (D&I) in the workplace",
    "Fostering safe, secure, and harmonious work environments"
  ],
  "competitive_advantages": [
    "Deep subject matter expertise, demonstrated by founder's authorship and extensive experience in sexual harassment prevention and D&I",
    "Hands-on experience working with various corporates and serving on POSH committees",
    "Ability to provide objective, external membership for POSH committees",
    "Strong focus on legal compliance with Sexual Harassment Laws",
    "Development and delivery of customized training programs"
  ],
  "hr_functions_supported": [
    "Workplace Safety & Compliance",
    "Employee Relations",
    "Diversity, Equity, and Inclusion (DEI)",
    "Learning & Development (Training)",
    "Employee Well-being"
  ],
  "roi_benefits": [
    "Reduced legal risks and potential penalties through compliance with Sexual Harassment Laws",
    "Improved employee morale and psychological safety within the workplace",
    "Enhanced employee engagement and productivity",
    "Cultivation of a positive workplace culture promoting diversity and inclusion",
    "Mitigation of reputational damage from harassment incidents"
  ],
  "searchable_keywords": [
    "CecureUs",
    "Viji Hari",
    "sexual harassment prevention",
    "POSH",
    "employee wellness",
    "workplace training",
    "committee training",
    "3rd party empanelment",
    "D&I",
    "Diversity and Inclusion",
    "workplace safety",
    "secure workplaces",
    "harmonious workplaces",
    "employee awareness",
    "HR compliance",
    "employee relations",
    "legal compliance",
    "harassment laws"
  ],
  "primary_users": [
    "HR professionals",
    "Internal POSH Committee members",
    "All employees within an organization"
  ],
  "compliance_features": [
    "Assistance with compliance to Sexual Harassment Laws",
    "Support for establishing and functioning of POSH (Prevention of Sexual Harassment) committees",
    "Provision of external expert members for POSH committees",
    "Legal awareness training for employees and committees"
  ],
  "_weight": 1
}