{
  "id": 480,
  "name": "Center for Leadership and Professional Development (Phnom Penh)",
  "description": "Today American University of Phnom Penh (AUPP) announced the first ever Center for Leadership and Professional Development (CLPD) that will bring internationally recognized training programs to Cambodia in order to help train and improve human resources and capacity building in Cambodia and the ASEAN region. The scope of key offerings will be in priority areas such as general management, leadership development, project and program management, communication and negotiation skills, human resource management, and financial management. The center will also offer sector specific programs in tourism and aviation, teacher and school development, and management programs for key industries such as hospitality, travel and tourism, construction, and agriculture. While the planned average CLPD prices will be slightly above competition, they still offer a great value-for- money compared to what Cambodian companies are paying when sending their staff to overseas or neighboring countries for none-specialized or highly skilled types of training.",
  "features": [
    "focused on key skills that are in high demand in the workforce",
    "center also offers industry specific programs such as aviation, teacher and school development, and tourism and hospitality industries",
    "Professional Training"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Learning and Development",
    "Other / technology"
  ],
  "sub_categories": [
    "Training eLearning software",
    "Learning Experience Systems (LXPs)",
    "Artificial intelligence"
  ],
  "tags": [
    "Learning efficiency",
    "Adaptive learning",
    "Personalised learning"
  ],
  "headquarter": "Phnom Penh, Cambodia",
  "launch_date": "2016",
  "order": 20440,
  "weightage": null,
  "HCM": null,
  "Headline": "Learn.Lead.Achieve",
  "ProductId": null,
  "ShortDescription": "CLPD is a training center that was created to offer world-class learning and development solutions to professionals and employers in Cambodia.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:28:14.486Z",
  "enhanced_description": "The Center for Leadership and Professional Development (CLPD), established by the American University of Phnom Penh (AUPP) in 2016, is the first of its kind in Cambodia. It is dedicated to bringing internationally recognized, world-class training programs to Cambodia and the ASEAN region. CLPD focuses on improving human resources and capacity building, with offerings in high-demand areas such as general management, leadership development, project and program management, communication and negotiation skills, human resource management, and financial management. The center also provides sector-specific programs for industries including tourism, aviation, teacher and school development, hospitality, travel and tourism, construction, and agriculture. While priced slightly above local competition, CLPD offers significant value compared to the costs companies incur when sending staff overseas for specialized training.",
  "target_industries": [
    "Tourism",
    "Aviation",
    "Education",
    "Hospitality",
    "Travel",
    "Construction",
    "Agriculture"
  ],
  "key_use_cases": [
    "Training and improving human resources",
    "Capacity building for organizations",
    "Accelerating skill development and learning efficiency for professionals",
    "Developing leadership capabilities",
    "Enhancing general management skills",
    "Improving project and program management proficiency",
    "Strengthening communication and negotiation skills",
    "Providing specialized professional development for specific industries (tourism, aviation, education, hospitality, travel, construction, agriculture)",
    "Offering a cost-effective alternative to overseas training for Cambodian companies"
  ],
  "competitive_advantages": [
    "First-ever Center for Leadership and Professional Development in Cambodia",
    "Offers internationally recognized training programs",
    "Provides world-class learning and development solutions",
    "Offers significant value-for-money compared to sending staff overseas for training"
  ],
  "hr_functions_supported": [
    "Learning and Development",
    "Skill Development",
    "Human Resources Management"
  ],
  "roi_benefits": [
    "Improved human resources and organizational capacity",
    "Accelerated skill development and learning efficiency",
    "Cost savings on professional training compared to overseas options"
  ],
  "searchable_keywords": [
    "Leadership Development",
    "Professional Development",
    "Training",
    "Cambodia",
    "Phnom Penh",
    "ASEAN",
    "Human Resources",
    "Capacity Building",
    "General Management",
    "Project Management",
    "Program Management",
    "Communication Skills",
    "Negotiation Skills",
    "Financial Management",
    "Tourism Training",
    "Aviation Training",
    "Teacher Development",
    "School Development",
    "Hospitality Management",
    "Construction Management",
    "Agriculture Management",
    "Learning and Development",
    "Skill Development",
    "Learning Efficiency",
    "Adaptive Learning",
    "Personalized Learning",
    "Workforce Training",
    "Professional Training",
    "World-class learning",
    "AUPP"
  ],
  "primary_users": [
    "Professionals",
    "Employers",
    "Company Staff"
  ],
  "_weight": 1
}