{
  "id": 489,
  "name": "Change Inc.",
  "description": "CHANGE, Inc. Community Action Agency was formed in 1983 by a handful of clergy members who wished to aid families affected by layoffs from Weirton Steel find new employment. Since that time, we have grown into a full-circle agency, addressing many of the needs of the economically disadvantaged. In its 29th year of operation, the belief of empowering families is still strong within the agency. The concept of “community action” was originally conceived as part of the War on Poverty Program launched by the Economic Opportunity Act of 1964. Community Action objectives focused on enabling people to achieve self-sufficiency and providing them with the resources to achieve that goal. The concept of community action, people working together to help people, became widely known throughout the Northern Panhandle. As the concept grew, additional services were developed and interest continued to grow in the community.",
  "features": [
    "Low-income people become more self-sufficient. ",
    "The conditions in which low-income people live are improved.",
    "Partnerships among supporters and providers of services to low-income people are achieved"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement"
  ],
  "categories": [
    "Total Rewards"
  ],
  "sub_categories": [
    "Health & safety providers",
    "Corporate wellness software"
  ],
  "tags": [
    "Employee well being",
    "Employee happiness programs"
  ],
  "headquarter": "Weirton, WV",
  "launch_date": "1983",
  "order": 20449,
  "weightage": null,
  "HCM": null,
  "Headline": "Empowering individuals and families towards healthy, self-sufficient living in the Ohio Valley area.",
  "ProductId": null,
  "ShortDescription": "CHANGE, Inc. encourages the integration of services, the building of partnerships, and the consolidating of resources to empower families towards healthy self-sufficient living.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:28:28.362Z",
  "enhanced_description": "CHANGE, Inc. is a Community Action Agency established in 1983, originally formed to assist families impacted by layoffs in finding new employment. Over its decades of operation, it has evolved into a comprehensive 'full-circle' agency dedicated to empowering economically disadvantaged individuals and families towards healthy, self-sufficient living. Operating in the Ohio Valley area, CHANGE, Inc. emphasizes integrating services, building strong partnerships, and consolidating resources to address the diverse needs of its community. It aims to improve employee happiness and engagement, particularly by providing health & safety services and corporate wellness programs to support the well-being of low-income individuals within organizations.",
  "ideal_company_sizes": [
    "Medium Enterprise"
  ],
  "key_use_cases": [
    "Improving employee well-being and engagement, especially for low-income employees.",
    "Facilitating self-sufficiency and economic empowerment for disadvantaged individuals.",
    "Improving living conditions for low-income populations.",
    "Developing community partnerships for service provision.",
    "Assisting with job placement and new employment for dislocated workers.",
    "Providing corporate wellness programs and services.",
    "Delivering health and safety services to employees and communities."
  ],
  "competitive_advantages": [
    "Long-standing experience and established presence in community action (since 1983).",
    "Comprehensive 'full-circle' approach to addressing the diverse needs of the economically disadvantaged.",
    "Strong focus on community action, fostering partnerships, and integrating services for holistic support.",
    "Specialization in empowering low-income individuals and families.",
    "Local expertise and established network in the Ohio Valley/Northern Panhandle area."
  ],
  "hr_functions_supported": [
    "Employee Well-being",
    "Employee Engagement",
    "Total Rewards",
    "Health & Safety",
    "Workforce Development",
    "Career Transition Support"
  ],
  "roi_benefits": [
    "Improved employee well-being and engagement, potentially leading to increased productivity and reduced absenteeism.",
    "Enhanced talent retention, particularly for at-risk or low-income employees.",
    "Demonstration of corporate social responsibility (CSR) and positive community impact.",
    "Facilitation of self-sufficiency for employees, potentially reducing reliance on company or public support.",
    "Access to health and safety services for employees."
  ],
  "searchable_keywords": [
    "Change Inc.",
    "Community Action Agency",
    "economically disadvantaged",
    "self-sufficiency",
    "community action",
    "empowering families",
    "new employment",
    "Total Rewards",
    "Health & safety providers",
    "Corporate wellness software",
    "Employee well being",
    "Employee happiness programs",
    "individual empowerment",
    "healthy living",
    "social services",
    "workforce development",
    "community partnerships",
    "low-income support",
    "Ohio Valley"
  ],
  "primary_users": [
    "HR Professionals",
    "Employees"
  ],
  "_weight": 1
}