{
  "id": 491,
  "name": "Chartered Management Institute",
  "description": "The Chartered Management Institute works with businesses and education providers to inspire people to unleash their potential and become skilled, confident and successful managers and leaders. In fact, CMI has more than 60,000 people training to be better leaders right now across our partner network in the UK and internationally. Backed by a unique Royal Charter, CMI is the only organisation able to award Chartered Manager status - the ultimate management accolade, which is proven to boost individuals’ career prospects, management capability and impact in the workplace. CMI’s thought leadership, research, events and online resources provide practical insight about critical issues for its 100,000 plus members and any professional looking to improve their results; create diverse high-performing teams and nurture the next generation of managers and leaders.",
  "features": [
    "5% say that Chartered Manager demonstrates their use of managerial skills to achieve organisational results ",
    "81% say that since becoming Chartered, they have used their managerial skills to lead people and manage change",
    "78% say that since becoming Chartered, they have had a positive impact on the wider team in their organisation (such as increased employee engagement)"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Learning and Development",
    "Other / technology"
  ],
  "sub_categories": [
    "Training eLearning software",
    "Learning Experience Systems (LXPs)",
    "Artificial intelligence"
  ],
  "tags": [
    "Learning efficiency",
    "Adaptive learning",
    "Personalised learning"
  ],
  "headquarter": "Corby",
  "launch_date": "1947",
  "order": 20451,
  "weightage": null,
  "HCM": null,
  "Headline": "We work with business and education to inspire people to become skilled, confident and successful managers and leaders.",
  "ProductId": null,
  "ShortDescription": "The Chartered Management Institute works with businesses and education providers to inspire people to unleash their potential and become skilled, confident and successful managers and leaders.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:28:31.102Z",
  "enhanced_description": "The Chartered Management Institute (CMI) is a prominent professional body dedicated to fostering skilled, confident, and successful managers and leaders. Established in 1947 and operating under a unique Royal Charter, CMI holds the exclusive authority to award Chartered Manager status, a highly regarded accolade that significantly boosts individuals' career prospects, management capability, and overall workplace impact. CMI actively supports over 60,000 individuals engaged in leadership training through its extensive partner network across the UK and internationally. The institute further enriches its community of over 100,000 members and other professionals through comprehensive thought leadership, research, events, and online resources. CMI's offerings are designed to accelerate skill development and learning efficiency, enabling professionals to improve their results, cultivate diverse high-performing teams, and effectively nurture the next generation of management and leadership talent.",
  "target_industries": [
    "Businesses (General)",
    "Education"
  ],
  "key_use_cases": [
    "Manager and Leader Development",
    "Professional Skill Acceleration",
    "Leadership Capability Enhancement",
    "Career Progression for Managers",
    "Improving Team Performance and Engagement",
    "Nurturing Next-Generation Leaders",
    "Personalized Learning Journeys",
    "Adaptive Learning Pathways"
  ],
  "competitive_advantages": [
    "Exclusive authority to award Chartered Manager status (backed by a unique Royal Charter)",
    "Proven impact on career prospects, management capability, and workplace results",
    "Extensive partner network and large membership base (over 100,000 members, 60,000 trainees)",
    "Comprehensive suite of resources including thought leadership, research, events, and online materials"
  ],
  "implementation_scenarios": [
    "Workplace leadership development programs",
    "Professional accreditation for managers",
    "Integration into educational curricula for management studies"
  ],
  "hr_functions_supported": [
    "Learning and Development",
    "Talent Management",
    "Employee Engagement"
  ],
  "roi_benefits": [
    "Achieve organizational results through enhanced managerial skills",
    "Improved ability to lead people and manage change",
    "Positive impact on wider team performance and employee engagement",
    "Boosted individual career prospects",
    "Enhanced management capability",
    "Increased workplace impact",
    "Accelerated skill development and learning efficiency",
    "Creation of diverse high-performing teams",
    "Nurturing of future management and leadership talent"
  ],
  "searchable_keywords": [
    "Chartered Management Institute",
    "CMI",
    "Management development",
    "Leadership development",
    "Manager training",
    "Leadership training",
    "Chartered Manager status",
    "Professional development",
    "Skill development",
    "Learning efficiency",
    "Adaptive learning",
    "Personalized learning",
    "E-learning",
    "LXP",
    "Learning experience platform",
    "Management accreditation",
    "Leadership accreditation",
    "Corporate training",
    "Professional body",
    "Leadership capability",
    "Employee engagement"
  ],
  "primary_users": [
    "Managers",
    "Leaders",
    "Aspiring Managers/Leaders",
    "Professionals seeking development",
    "HR Professionals (procuring L&D solutions)",
    "Education Providers"
  ],
  "deployment_options": [
    "Cloud-based (online resources)",
    "Partner-led programs"
  ],
  "_weight": 1
}