{
  "id": 492,
  "name": "CHRD",
  "description": "The Consortium For Human Resource Development (CHRD) is a Not for Profit HR & L&D Association & is an initiative of Ashrita Foundation (www. ashritafoundation.in). It includes professionals, academicians and students those who are interested or involved in Human Resource Management and development of people. Our focus is at creating an environment of “learning by sharing” thereby enhancing the capability of human resource professionals to contend globally and thereby creating value for all. The CHRD is committed to the development of human resources through knowledge sharing, experiential learning, training & research. The CHRD is the outcome of team of professionals who have passion for human resources and believe in value creation for its members and society at large. Learning is considered a continuous process here and we are committed to \"learn, share and grow\" with the latest and the best practices, for excellence in human resource management.",
  "features": [
    "To serve as a forum for exchange of ideas, experiences, collection and dissemination of HRD information & knowledge",
    "To observe, absorb and apply new knowledge and skills pertaining to HRD practices through R&D.",
    "To organize activities and programmes with a view to upgrade the skills and professional standards of HR fraternity."
  ],
  "founders": [
    "DR. AJIT KUMAR KAR"
  ],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Learning and Development",
    "Other / technology"
  ],
  "sub_categories": [
    "Training eLearning software",
    "Learning Experience Systems (LXPs)",
    "Artificial intelligence"
  ],
  "tags": [
    "Learning efficiency",
    "Adaptive learning",
    "Personalised learning"
  ],
  "headquarter": "Bhubaneswar, Orissa",
  "launch_date": "1987",
  "order": 20452,
  "weightage": null,
  "HCM": null,
  "Headline": "Not for Profit organisation of professionals, academicians and students those who are interested in or involved in Human Resource Management and development of people.",
  "ProductId": null,
  "ShortDescription": "Consortium For Human Resource Development (CHRD) is a Not for Profit organisation of professionals, academicians and students those who are interested in or involved in Human Resource Management and development of people.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:28:32.228Z",
  "enhanced_description": "The Consortium For Human Resource Development (CHRD), an initiative of Ashrita Foundation, is a Not for Profit HR & L&D Association established in 1987. It serves as a comprehensive forum for professionals, academicians, and students involved in Human Resource Management and development. CHRD focuses on fostering an environment of 'learning by sharing' to enhance the global capability of HR professionals and create value for its members and society. The association is dedicated to human resource development through continuous knowledge sharing, experiential learning, training, and research, aiming to accelerate skill development and learning efficiency by adhering to the latest and best practices in HR management.",
  "key_use_cases": [
    "Professional Development for HR professionals",
    "Knowledge Sharing and Dissemination of HRD information",
    "Skill Upgradation for HR fraternity",
    "Experiential Learning and Training in HRD practices",
    "Research and Development in Human Resource Development (HRD)",
    "Forum for exchange of ideas and experiences among HR professionals"
  ],
  "competitive_advantages": [
    "Not-for-profit organizational model focused on community and value creation",
    "Emphasis on 'learning by sharing' fostering a collaborative environment",
    "Commitment to continuous development through knowledge sharing, experiential learning, training, and research",
    "Driven by a team of passionate HR professionals dedicated to member and societal value creation",
    "Focus on adopting latest and best practices for excellence in HR management"
  ],
  "hr_functions_supported": [
    "Learning & Development",
    "HR Strategy & Planning (implied by excellence and global competitiveness)",
    "Professional Networking"
  ],
  "roi_benefits": [
    "Enhanced capability of human resource professionals",
    "Improved global competitiveness for HR professionals",
    "Accelerated skill development",
    "Upgraded professional standards within the HR fraternity",
    "Value creation for members and society at large"
  ],
  "searchable_keywords": [
    "CHRD",
    "Consortium For Human Resource Development",
    "Not for Profit",
    "HR Association",
    "L&D Association",
    "Human Resource Management",
    "People Development",
    "Learning by Sharing",
    "Knowledge Sharing",
    "Experiential Learning",
    "HR Training",
    "HR Research",
    "HRD Information",
    "Professional Development",
    "Skill Development",
    "Learning Efficiency",
    "Adaptive Learning",
    "Personalised Learning",
    "HR Fraternity",
    "HR Professionals",
    "Academicians",
    "Students",
    "Bhubaneswar",
    "Orissa",
    "Ashrita Foundation"
  ],
  "primary_users": [
    "HR Professionals",
    "L&D Professionals",
    "Academicians (interested/involved in HR/L&D)",
    "Students (interested/involved in HR/L&D)"
  ],
  "_weight": 1
}