{
  "id": 494,
  "name": "CI Agile",
  "description": "We are the first and only Agile training and consultancy company in South East Asia endorsed by Dr. Sutherland, the inventor of Scrum and the co-signatory of the Agile manifesto. We helped hundreds of organizations to successfully transform the way they work. We provide the resources and knowledge necessary to address your needs and drive better business outcome. With every client, we learn how Scrum fundamentally changes their way of working, and we use that knowledge to evolve Scrum and advance Agile practices around the globe. We believe in creating a productive and happy workplace through mentorship, training, and credentialing the next generation of Scrum Inc. trainers. Our global presence continues to grow so that we can be accessible to you whenever and wherever you are.",
  "features": [
    "uniquely designed to enhance the learning experience ",
    "Education Management",
    "CI Agile implements the Scrum and Scrum@Scale knowledge"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency",
    "Improve Employee Happiness and Engagement",
    "Build a More Diverse and Inclusive Workforce",
    "Boost Hiring Manager Confidence and Productivity"
  ],
  "categories": [
    "Talent Management",
    "Learning and Development",
    "Recruiting",
    "Total Rewards"
  ],
  "sub_categories": [
    "Benefits administration services",
    "Employee engagement software",
    "Onboarding software",
    "Training eLearning software",
    "Staffing services providers",
    "Recruitment agencies",
    "Training management system",
    "HR analytics software",
    "Recruiting software"
  ],
  "tags": [
    "Skill development",
    "Learning efficiency",
    "Training effectiveness",
    "Learning speed",
    "Workforce diversity",
    "Hiring analytics",
    "Recruiting"
  ],
  "headquarter": "Singapore, SG",
  "launch_date": "2020",
  "order": 20454,
  "weightage": null,
  "HCM": null,
  "Headline": "The Asia Pacific Regional Partner of Agile Education Program by Scrum Inc.",
  "ProductId": null,
  "ShortDescription": "CI Agile was founded to be a higher learning center for Dr Jeff Sutherland's original Scrum knowledge by uncovering better ways of practicing it and helping others to learn it.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:28:36.850Z",
  "enhanced_description": "CI Agile is the leading Agile training and consultancy company in South East Asia, uniquely recognized as the first and only one endorsed by Dr. Sutherland, the inventor of Scrum and co-signatory of the Agile manifesto. As the Asia Pacific Regional Partner for Scrum Inc.'s Agile Education Program, CI Agile serves as a higher learning center dedicated to Dr. Jeff Sutherland's original Scrum knowledge. The company specializes in helping hundreds of organizations successfully transform their ways of working by implementing Scrum and Scrum@Scale. They provide essential resources and knowledge, focusing on mentorship, training, and credentialing the next generation of Scrum Inc. trainers, aiming to drive better business outcomes and foster productive, happy workplaces. With a growing global presence, CI Agile is accessible to clients worldwide, committed to evolving Scrum and advancing Agile practices.",
  "key_use_cases": [
    "Organizational Agile transformation and adoption",
    "Implementation and optimization of Scrum and Scrum@Scale methodologies",
    "Accelerating skill development and learning efficiency in Agile practices",
    "Employee training and credentialing for Agile and Scrum",
    "Enhancing employee happiness and engagement through improved work processes",
    "Mentoring and developing future Scrum Inc. trainers",
    "Driving better business outcomes through Agile adoption",
    "Supporting initiatives for a more diverse and inclusive workforce via Agile principles",
    "Improving hiring manager confidence and productivity through agile team performance"
  ],
  "competitive_advantages": [
    "First and only Agile training and consultancy company in South East Asia endorsed by Dr. Sutherland (inventor of Scrum and Agile manifesto co-signatory)",
    "Exclusive Asia Pacific Regional Partner of the Agile Education Program by Scrum Inc.",
    "Focus on Dr. Jeff Sutherland's original Scrum knowledge and its evolution",
    "Proven track record of helping hundreds of organizations transform",
    "Global presence providing accessibility",
    "Uniquely designed approach to enhance the learning experience"
  ],
  "implementation_scenarios": [
    "Organizational-wide Agile transformation programs",
    "Team-specific Scrum and Scrum@Scale implementation projects",
    "Ongoing mentorship and training programs for Agile practitioners",
    "Credentialing pathways for Agile roles (e.g., Scrum Inc. trainers)",
    "Consultancy engagements to address specific organizational challenges using Agile principles"
  ],
  "hr_functions_supported": [
    "Learning and Development",
    "Talent Management",
    "Employee Engagement",
    "Recruiting",
    "Diversity & Inclusion"
  ],
  "roi_benefits": [
    "Successful organizational transformation in ways of working",
    "Improved business outcomes",
    "Creation of productive and happy workplaces",
    "Accelerated skill development and learning efficiency",
    "Enhanced employee happiness and engagement",
    "Contribution to building a more diverse and inclusive workforce",
    "Boosted hiring manager confidence and productivity"
  ],
  "searchable_keywords": [
    "CI Agile",
    "Agile training",
    "Agile consultancy",
    "Scrum training",
    "Scrum@Scale",
    "Dr. Sutherland",
    "Jeff Sutherland",
    "Agile manifesto",
    "South East Asia",
    "organizational transformation",
    "business outcome",
    "productive workplace",
    "happy workplace",
    "mentorship",
    "credentialing",
    "Scrum Inc.",
    "skill development",
    "learning efficiency",
    "training effectiveness",
    "learning speed",
    "workforce diversity",
    "hiring analytics",
    "recruiting",
    "talent management",
    "learning and development",
    "employee engagement",
    "education management",
    "training management system"
  ],
  "primary_users": [
    "Organizations (clients seeking transformation and training)",
    "Individuals seeking Agile and Scrum knowledge and certification",
    "HR professionals (for L&D, talent management, engagement, D&I initiatives)",
    "Team leaders and managers undergoing Agile adoption",
    "Hiring managers"
  ],
  "_weight": 1
}