{
  "id": 536,
  "name": "DocOnline Health India",
  "description": "DocOnline is an innovative digital healthcare company that delivers humane and compassionate care by focusing on clinical quality with technology as an enabler. It provides video/phone doctor consultations through over 60 carefully selected in-house doctors trained in telemedicine, equipped with evidence-based clinical tools for appropriate diagnosis and treatment. The model focuses on health outcomes and continuous clinical quality improvements to build patient trust. DocOnline is working with 150+ corporates enabling them to deliver Employee Health and Wellness programs, value-added benefits to their customers, and community CSR initiatives.",
  "features": [
    "we believe that trust is the foundation of all relationships. While being at the forefront of the digital healthcare revolution",
    "we strive to deliver high-quality, affordable, and accessible healthcare",
    "We are always driven by our values of Quality, Compassion and Care."
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement"
  ],
  "categories": [
    "Total Rewards"
  ],
  "sub_categories": [
    "Corporate wellness software"
  ],
  "tags": [
    "Employee well being",
    "Employee benefits"
  ],
  "headquarter": "Bangalore, Karnataka",
  "launch_date": "2016",
  "order": 20496,
  "weightage": null,
  "HCM": null,
  "Headline": "Driven by Care. Powered by Technology.",
  "ProductId": null,
  "ShortDescription": "DocOnline is an innovative digital healthcare company that delivers humane and compassionate care by focusing on clinical quality with technology as an enabler. I",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:29:28.173Z",
  "enhanced_description": "DocOnline is an innovative digital healthcare company, driven by care and powered by technology, delivering high-quality, affordable, and accessible video/phone doctor consultations. With over 60 carefully selected in-house doctors trained in telemedicine and equipped with evidence-based clinical tools, DocOnline focuses on clinical quality, health outcomes, and continuous improvement to build patient trust. The platform is specifically designed to support corporate Employee Health and Wellness programs, value-added employee benefits, and community CSR initiatives for over 150 corporate clients, aiming to improve employee happiness and engagement.",
  "ideal_company_sizes": [
    "Medium",
    "Large"
  ],
  "key_use_cases": [
    "Providing tele-doctor consultations for employees",
    "Implementing corporate wellness programs",
    "Offering value-added employee benefits",
    "Supporting community CSR initiatives"
  ],
  "competitive_advantages": [
    "Access to over 60 carefully selected in-house doctors trained in telemedicine",
    "Doctors equipped with evidence-based clinical tools for diagnosis and treatment",
    "Focus on health outcomes and continuous clinical quality improvements",
    "Delivers humane and compassionate care",
    "Aims to provide affordable and accessible healthcare"
  ],
  "hr_functions_supported": [
    "Employee Benefits Administration",
    "Employee Well-being & Wellness",
    "Employee Engagement"
  ],
  "roi_benefits": [
    "Improved Employee Happiness",
    "Improved Employee Engagement",
    "Delivery of high-quality, affordable, and accessible healthcare for employees"
  ],
  "searchable_keywords": [
    "DocOnline",
    "digital healthcare",
    "telemedicine",
    "online doctor",
    "virtual doctor",
    "video consultation",
    "phone consultation",
    "corporate wellness",
    "employee health",
    "employee well-being",
    "employee benefits",
    "total rewards",
    "HR tech",
    "health and wellness",
    "employee engagement",
    "CSR",
    "India"
  ],
  "primary_users": [
    "Employees (as beneficiaries of consultations and wellness programs)",
    "HR Professionals (managing employee health and wellness programs)",
    "Corporate Clients (implementing the platform)",
    "In-house Doctors (providing consultations)"
  ],
  "deployment_options": [
    "Cloud-based"
  ],
  "_weight": 1
}