{
  "id": 547,
  "name": "Edukasi Jobs",
  "description": "Edukasi Jobs an online job portal specialising in education sector job vacancies in Indonesia. Built and owned by passionate teaching professionals who have a deep understanding of education in Indonesia, and its unique challenges. We are committed to continuously improving the value we provide to job seekers and educational institutions. To deliver on this, we will continue to evolve our product and service offerings to better facilitate the matching of job seekers to educational institutions. We are excited to be able to support the on-going development of the education sector in our home market of Indonesia.",
  "features": [
    "An opportunity to only deliver your message to the specific group of people you are interested in through a targeted job board. With Edukasi Jobs you can be guaranteed that the right kinds of candidates are viewing your vacancy.",
    "An opportunity to only deliver your message to the specific group of people you are interested in through a targeted job board. With Edukasi Jobs you can be guaranteed that the right kinds of candidates are viewing your vacancy.",
    "The quality of applicants is better. Applicants who use Edukasi Jobs are more passionate about the teaching and education, where they are seeking employment. Generalised job boards often result in applications from unqualified and inexperienced individuals."
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Fill Open Positions More Quickly"
  ],
  "categories": [
    "Recruiting"
  ],
  "sub_categories": [
    "Staffing & management software",
    "Recruiting automation software",
    "Job boards",
    "Recruiting software"
  ],
  "tags": [
    "Hiring speed",
    "Talent sourcing",
    "Candidate screening",
    "Job boards"
  ],
  "headquarter": "Jakarta Selatan , DKI Jakarta",
  "launch_date": "2020",
  "order": 20507,
  "weightage": null,
  "HCM": null,
  "Headline": "Inspire The Future",
  "ProductId": null,
  "ShortDescription": "Edukasi Jobs is an online job portal specialising in education sector job vacancies in Indonesia. Built and owned by passionate teaching professionals who have a deep understanding of education in Indonesia, and its unique challenges.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:29:38.900Z",
  "enhanced_description": "Edukasi Jobs is a specialized online job portal for the education sector in Indonesia, designed to facilitate efficient matching between job seekers and educational institutions. Built and owned by passionate teaching professionals with a deep understanding of Indonesia's education landscape and its unique challenges, it aims to help institutions fill open positions more quickly with high-quality, passionate candidates by providing a targeted platform that attracts relevant talent.",
  "target_industries": [
    "Education"
  ],
  "key_use_cases": [
    "Posting specialized job vacancies for education sector roles.",
    "Sourcing high-quality and passionate candidates for teaching and education positions.",
    "Expediting the hiring process for educational institutions.",
    "Filtering out unqualified and inexperienced applicants."
  ],
  "competitive_advantages": [
    "Specialization in the Indonesian education sector.",
    "Deep understanding of the education sector's unique challenges in Indonesia.",
    "Targeted job board approach ensures relevant candidate reach.",
    "Higher quality and more passionate applicants compared to general job boards.",
    "Reduces applications from unqualified and inexperienced individuals."
  ],
  "hr_functions_supported": [
    "Recruiting",
    "Talent Sourcing",
    "Candidate Screening",
    "Job Posting"
  ],
  "roi_benefits": [
    "Faster time-to-hire for education sector roles.",
    "Improved quality of hires for educational institutions.",
    "Reduced time and effort spent on screening unqualified candidates.",
    "More efficient talent acquisition process due to targeted reach."
  ],
  "searchable_keywords": [
    "Education jobs Indonesia",
    "Teaching jobs Indonesia",
    "Education sector recruitment",
    "Online job portal Indonesia",
    "Specialized job board education",
    "HR recruitment software",
    "Talent sourcing education",
    "Candidate screening education",
    "Job vacancies education Indonesia",
    "Education employment Indonesia",
    "School jobs Indonesia",
    "University jobs Indonesia",
    "Targeted job board",
    "Quality applicants",
    "Indonesia education jobs",
    "Recruiting education",
    "Job board Indonesia",
    "Education sector hiring"
  ],
  "primary_users": [
    "Job seekers (in education sector)",
    "Educational institutions"
  ],
  "deployment_options": [
    "Cloud-based"
  ],
  "_weight": 1
}