{
  "id": 565,
  "name": "Equilibrio Advisory LLP",
  "description": "Equilibrio is a team of qualified professionals such as Legal experts (who have diversified knowledge and practical experience in the legal field), Psychological experts (who have thorough experience of counselling as well as working with women and children on the field) and Social Workers. Working with various organisations varying from education to finance to media organisations, our entire team has first-hand experience of dealing with matters relating to abuse, sexual or otherwise. Because of our combined expertise, we are also in a position to guide, not just the employer but also employees and managers at all levels. We are also able to have effective age appropriate conversations with children to create awareness about such topics. This, along with our expertise on providing training / awareness sessions at all levels for handling, prevention, prohibition and redressal allows us to achieve our ultimate goal of building Equitable & Safe Spaces. This makes us a unique combination of a full service legal and counselling organisation, which proves us to be a valuable asset for any organization.",
  "features": [
    "Foucssed on Equitabe and safe workplace",
    "Working towards Safety against abuses to children",
    "Nuturing mental health"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement"
  ],
  "categories": [
    "Total Rewards"
  ],
  "sub_categories": [
    "Health & safety providers",
    "Corporate wellness software"
  ],
  "tags": [
    "Employee well being",
    "Employee happiness programs"
  ],
  "headquarter": "Mumbai, Maharashtra",
  "launch_date": "2021",
  "order": 20524,
  "weightage": null,
  "HCM": null,
  "Headline": "Building Equitable & Safe Spaces",
  "ProductId": null,
  "ShortDescription": "Equilibrio is a team of qualified professionals such as Legal experts (who have diversified knowledge and practical experience in the legal field), Psychological experts (who have thorough experience of counselling as well as working with women and children on the field) and Social Workers.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:30:09.230Z",
  "enhanced_description": "Equilibrio Advisory LLP is a unique full-service legal and counselling organization comprising qualified Legal experts, Psychological experts, and Social Workers. Their core mission is to build Equitable & Safe Spaces within organizations and for children. They provide expertise in handling, preventing, prohibiting, and redressing matters related to abuse, sexual or otherwise, having first-hand experience across diverse sectors including education, finance, and media. Equilibrio offers guidance and awareness sessions for employers, employees, and managers at all levels, alongside age-appropriate conversations for children to foster safety against abuses and nurture mental health. This combined expertise makes them a valuable asset for any organization seeking to improve employee happiness and engagement by ensuring a secure and supportive work environment.",
  "target_industries": [
    "Education",
    "Finance",
    "Media"
  ],
  "ideal_company_sizes": [
    "Any Organization Size"
  ],
  "key_use_cases": [
    "Handling and redressing matters related to abuse (sexual or otherwise)",
    "Providing training and awareness sessions on prevention and prohibition of abuse",
    "Guiding employers, employees, and managers on workplace safety and conduct",
    "Creating awareness about abuse among children",
    "Nurturing mental health within the workplace",
    "Building equitable and safe workplace environments"
  ],
  "competitive_advantages": [
    "Unique combination of full-service legal and counselling expertise",
    "Team composed of Legal experts, Psychological experts, and Social Workers",
    "First-hand experience in dealing with abuse matters across various organizations",
    "Ability to guide employers, employees, and managers at all levels",
    "Capability to conduct age-appropriate awareness conversations with children"
  ],
  "hr_functions_supported": [
    "Employee Relations",
    "Workplace Health & Safety",
    "Corporate Wellness",
    "Training & Development",
    "Employee Engagement"
  ],
  "roi_benefits": [
    "Improved employee happiness and engagement",
    "Creation of equitable and safe workplaces",
    "Reduced risks associated with workplace abuse"
  ],
  "searchable_keywords": [
    "Equilibrio Advisory LLP",
    "Legal experts",
    "Psychological experts",
    "Counselling",
    "Social Workers",
    "Workplace safety",
    "Equitable workplace",
    "Safe spaces",
    "Abuse prevention",
    "Abuse redressal",
    "Sexual harassment prevention",
    "Mental health support",
    "Employee well-being",
    "Employee happiness programs",
    "Corporate wellness",
    "Health and safety providers",
    "Workplace training",
    "Awareness sessions"
  ],
  "primary_users": [
    "Employers",
    "Employees",
    "Managers (at all levels)",
    "Children"
  ],
  "_weight": 1
}