{
  "id": 571,
  "name": "Evexia Collective",
  "description": "At Evexia, we ensure that employees are at the centre of your organisation and have support to help them give 100%. This reduces wasted costs and helps your biggest asset perform better, making your business more money. Our team includes doctors with direct medical experience and treatment of patients and best mental health practices in both community and psychiatric settings. This gives us a unique insight to the impact of Mental Fitness as well as shared passion in proactive mental well-being support",
  "features": [
    "At the heart of your decision-making capabilities, problem solving, attention span and your goals. The part of the brain that Focus corresponds to is known as the Parietal Frontal Executive System. This is heavily involved in our executive functions, such as making decisions and logical thought.",
    "How positive, motivated and driven you feel. It includes sleep and passion for life and activities. The part of the brain that Energy corresponds to is known as the Limbic system.",
    "Relates to your sense of balance, how you manage stress and your ability to relax and switch off.  It also is involved with making memories. The part of the brain that Calm corresponds to is known as the Default mode"
  ],
  "founders": [
    "Rebecca Kane"
  ],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement",
    "Build a More Diverse and Inclusive Workforce"
  ],
  "categories": [
    "Total Rewards"
  ],
  "sub_categories": [
    "Corporate wellness software"
  ],
  "tags": [
    "Employee well being",
    "Workplace diversity"
  ],
  "headquarter": "Singapore, SG",
  "launch_date": "2021",
  "order": 20530,
  "weightage": null,
  "HCM": null,
  "Headline": "Mental Fitness for \n \n\n Workplace Productivity",
  "ProductId": null,
  "ShortDescription": "Our team includes doctors with direct medical experience and treatment of patients and best mental health practices in both community and psychiatric settings.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:30:16.591Z",
  "enhanced_description": "Evexia Collective is a corporate wellness software specializing in proactive mental well-being and 'Mental Fitness' to enhance workplace productivity. The platform's approach is rooted in direct medical and psychiatric experience, with a team of doctors providing unique insights into mental health practices. Evexia supports employees by addressing key mental fitness components: Focus (improving decision-making, problem-solving, and attention), Energy (boosting positivity, motivation, and managing sleep), and Calm (aiding stress management, relaxation, and memory). The primary goal is to improve employee happiness and engagement, reduce wasted costs associated with underperforming employees, and ultimately increase business revenue by enabling the workforce to perform at their peak. It aligns with broader HR objectives such as enhancing total rewards offerings and fostering a more engaged and high-performing workforce.",
  "key_use_cases": [
    "Improving employee mental well-being and fitness",
    "Enhancing workplace productivity through mental focus and energy management",
    "Supporting employee stress management and relaxation",
    "Boosting employee happiness and engagement",
    "Reducing costs associated with employee underperformance",
    "Facilitating proactive mental health support within organizations"
  ],
  "competitive_advantages": [
    "Team composed of doctors with direct medical and psychiatric experience, offering unique insights into mental fitness",
    "Proactive mental well-being support with a specific focus on 'Mental Fitness' for productivity",
    "Scientific understanding of mental states (Focus, Energy, Calm) linked to specific brain functions (Parietal Frontal Executive System, Limbic system, Default mode)"
  ],
  "hr_functions_supported": [
    "Employee Well-being",
    "Employee Engagement",
    "Total Rewards",
    "Workplace Productivity Management"
  ],
  "roi_benefits": [
    "Reduction in wasted costs associated with employee underperformance",
    "Increased business revenue through improved employee productivity and performance",
    "Enhanced employee happiness and engagement",
    "Improved overall workplace productivity"
  ],
  "searchable_keywords": [
    "Evexia Collective",
    "mental fitness",
    "workplace productivity",
    "employee well-being",
    "corporate wellness software",
    "mental health support",
    "proactive mental well-being",
    "employee engagement",
    "stress management",
    "focus",
    "energy",
    "calm",
    "executive functions",
    "decision making",
    "problem solving",
    "employee support",
    "total rewards",
    "HR tech",
    "wellness platform",
    "doctors",
    "psychiatric support",
    "employee happiness",
    "cost reduction",
    "performance improvement",
    "workplace diversity"
  ],
  "primary_users": [
    "Employees",
    "HR Professionals",
    "Company Leadership / Management"
  ],
  "_weight": 1
}