{
  "id": 629,
  "name": "Growth360",
  "description": "GROWTH360 is founded by Akanksha Malik—a professional with 18 years of global corporate experience in managing complex an diverse projects focused around Recruitment and Learning Development. She has been a member of the leadership team in many of her corporate roles. She has worked with Intel, GE Capital Services, iGate Mastech and Kelly Service (APAC) to name a few. Akanksha has been instrumental in setting up as well as improving HRO processes including RPO for organizations and has in-depth and hands on knowledge of best practices in handling large scale recruitment processes. She has also worked on building diverse and flexible workforce with flexible working arrangements (to suit physically challenged professionals as well as new mothers) in her corporate roles. Akanksha has a passion for working in the social impact sector and has been instrumental in supporting some of the social impact sector projects.",
  "features": [
    "EXECUTIVE SEARCH",
    "BUSINESS PROCESS CONSULTING",
    "HUMAN PERFORMANCE IMPROVEMENT"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Talent Management",
    "Recruiting"
  ],
  "sub_categories": [
    "HR management suites",
    "Recruiting software"
  ],
  "tags": [
    "Recruiting",
    "Talent acquisition"
  ],
  "headquarter": "Gurgaon, Haryana",
  "launch_date": "2014",
  "order": 20586,
  "weightage": null,
  "HCM": null,
  "Headline": "A boutique executive search firm that helps hire niche and leadership talent for companies that are scaling up.",
  "ProductId": null,
  "ShortDescription": "𝗚𝗥𝗢𝗪𝗧𝗛𝟯𝟲𝟬 is a boutique consulting firm that helps connect the dots between business and people goals. We believe people perform best when they are completely aligned with the organization’s DNA and goals. We strive to impact profitability and scalability in organizations by helping attract and grow the “right” talent using optimal business processes.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:31:27.302Z",
  "enhanced_description": "Growth360 is a boutique executive search and consulting firm, established in 2014, that connects business and people goals to drive organizational profitability and scalability. The firm specializes in executive search, focusing on hiring niche and leadership talent for companies undergoing rapid growth and scaling up. Growth360 also provides business process consulting and human performance improvement services. Founded by Akanksha Malik, who brings 18 years of global corporate experience in recruitment and learning development, the firm leverages deep expertise in setting up and improving HRO processes, including RPO, and possesses hands-on knowledge of best practices in large-scale recruitment. Growth360's services extend to building diverse and flexible workforces, with a focus on accelerating skill development and learning efficiency for their clients.",
  "ideal_company_sizes": [],
  "key_use_cases": [
    "Executive talent acquisition (niche and leadership roles)",
    "Optimizing HR business processes (including HRO and RPO)",
    "Accelerating skill development and learning efficiency",
    "Improving human performance within organizations",
    "Aligning people strategies with organizational goals",
    "Building diverse and flexible workforces"
  ],
  "competitive_advantages": [
    "Specialization as a boutique executive search and consulting firm for niche and leadership talent.",
    "Founder's 18 years of global corporate experience in recruitment and learning development, including leadership roles at companies like Intel, GE Capital Services, and Kelly Service (APAC).",
    "Expertise in setting up and improving HRO processes, including RPO.",
    "In-depth, hands-on knowledge of best practices in large-scale recruitment processes.",
    "Experience in building diverse and flexible workforces.",
    "Focus on connecting business and people goals to directly impact profitability and scalability."
  ],
  "hr_functions_supported": [
    "Recruitment",
    "Talent Management",
    "Learning & Development",
    "HR Process Optimization",
    "Recruitment Process Outsourcing (RPO)",
    "Workforce Planning & Diversity"
  ],
  "roi_benefits": [
    "Increased organizational profitability",
    "Enhanced organizational scalability",
    "Improved attraction and growth of the 'right' talent",
    "Accelerated skill development and learning efficiency",
    "Optimization of business processes"
  ],
  "searchable_keywords": [
    "Growth360",
    "Akanksha Malik",
    "Executive Search",
    "Business Process Consulting",
    "Human Performance Improvement",
    "Recruitment",
    "Talent Management",
    "Talent Acquisition",
    "Learning Development",
    "Skill Development",
    "Niche Talent",
    "Leadership Talent",
    "Scaling Companies",
    "HR Consulting",
    "HRO",
    "RPO",
    "HR Processes",
    "Workforce Development",
    "Diverse Workforce",
    "Flexible Workforce",
    "Profitability",
    "Scalability",
    "Gurgaon",
    "Haryana"
  ],
  "primary_users": [
    "Companies that are scaling up",
    "Organizations seeking niche and leadership talent",
    "Businesses looking to optimize their HR processes",
    "Companies focused on accelerating skill development and learning efficiency",
    "HR Leaders",
    "Business Leaders",
    "Talent Acquisition Leaders",
    "Learning & Development Leaders"
  ],
  "_weight": 1
}