{
  "id": 748,
  "name": "International Institute of Sports Management",
  "description": "IISM, which pioneered Sports Management education in India, is proud to welcome its students and partners to its sprawling, new campus, at Fleet House on Andheri Kurla Road, Marol Naka, Mumbai. The state-of-the-art facility is a significant milestone for IISM, as it enters its tenth year. The campus is embellished with all the facilities and amenities that characterise an educational institution that is dynamic, proactive and most importantly, student-friendly. The classrooms are centrally air-conditioned and comprise audio-visual equipment to facilitate interactive learning. There is a research lab as well. The students will have access to Wi-Fi (complimentary), refreshments through the day and breakout areas in which to socialise. The new campus is accessible from across the city of Mumbai by road, rail and metro. It is situated ten minutes from the international airport. IISM remains committed to the cause that it pioneered – to nurture and mould sports management professionals who will do the country proud",
  "features": [
    "Full-time degree in collaboration with University of Mumbai",
    "Innovative & Sports Industry led curriculum",
    "Highly Qualified & Experienced Faculty from Sports Industry"
  ],
  "founders": [
    "MS. RASIKA KULKARNI"
  ],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Learning and Development"
  ],
  "sub_categories": [
    "Training eLearning software",
    "Training management system"
  ],
  "tags": [
    "Learning efficiency",
    "Adaptive learning",
    "Training effectiveness"
  ],
  "headquarter": "Mumbai, Maharashtra",
  "launch_date": "2010",
  "order": 20701,
  "weightage": false,
  "HCM": null,
  "Headline": "Pioneer in Sports Management Education in India",
  "ProductId": null,
  "ShortDescription": "International Institute of Sports Management pioneered Sports Management education in India.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [
    {
      "name": "Focus on Sports Management and Sports Science Education",
      "sequence": 0,
      "description": " The International Institute of Sports & Management (IISM) offers undergraduate and postgraduate programs in sports management and sports science. This highlights their specialization in these fields."
    },
    {
      "name": "Experienced Faculty",
      "sequence": 1,
      "description": "The article mentions IISM's faculty, suggesting that they have a team of experienced professionals who can provide students with valuable insights and knowledge."
    },
    {
      "name": "Practical Industry Experience",
      "sequence": 2,
      "description": "The document discusses IISM's commitment to providing students with practical experience in the sports industry. This suggests that their programs may include internships or other opportunities to gain hands-on experience."
    }
  ],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": true,
  "Large_Enterprise": true,
  "Small_Enterprise": true,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:33:41.969Z",
  "enhanced_description": "The International Institute of Sports Management (IISM), a pioneer in Sports Management education in India since 2010, offers full-time undergraduate and postgraduate degree programs in sports management and sports science in collaboration with the University of Mumbai. The institute emphasizes an innovative, sports industry-led curriculum and boasts highly qualified and experienced faculty directly from the sports industry. IISM is committed to providing students with practical industry experience through opportunities like internships. Its state-of-the-art campus in Mumbai, accessible by various transport modes and located ten minutes from the international airport, features centrally air-conditioned classrooms with audio-visual equipment for interactive learning, a research lab, complimentary Wi-Fi, refreshments, and social breakout areas, all designed to be student-friendly. IISM's core mission is to nurture and mould sports management professionals who will contribute significantly to the country's sports industry, focusing on accelerating skill development and learning efficiency.",
  "key_use_cases": [
    "Providing full-time undergraduate and postgraduate education in sports management and sports science.",
    "Nurturing and molding sports management professionals.",
    "Facilitating interactive learning through modern classroom facilities.",
    "Offering practical industry experience to students.",
    "Accelerating skill development and learning efficiency in the sports industry."
  ],
  "competitive_advantages": [
    "Pioneered Sports Management education in India.",
    "Offers full-time degrees in collaboration with the University of Mumbai.",
    "Innovative and Sports Industry-led curriculum.",
    "Highly qualified and experienced faculty from the sports industry.",
    "Strong focus on providing practical industry experience.",
    "State-of-the-art campus facilities designed for student-friendly learning (centrally air-conditioned classrooms, audio-visual equipment, research lab, Wi-Fi, breakout areas).",
    "Strategic location in Mumbai with excellent accessibility."
  ],
  "hr_functions_supported": [
    "Learning and Development (as a provider of education and training)",
    "Talent Development (for the sports industry)"
  ],
  "roi_benefits": [
    "Produces skilled sports management professionals ready for the industry.",
    "Accelerates skill development and learning efficiency for students.",
    "Provides students with practical industry experience, enhancing job readiness.",
    "Access to a curriculum guided by industry needs and expert faculty."
  ],
  "searchable_keywords": [
    "International Institute of Sports Management",
    "IISM",
    "Sports Management education",
    "Sports Science education",
    "Sports industry curriculum",
    "Sports management professionals",
    "Learning and Development",
    "Skill Development",
    "Adaptive learning",
    "Training effectiveness",
    "Pioneering education",
    "Mumbai",
    "Undergraduate programs",
    "Postgraduate programs",
    "Practical industry experience",
    "Experienced faculty",
    "Training eLearning software",
    "Training management system",
    "University of Mumbai collaboration"
  ],
  "primary_users": [
    "Undergraduate students",
    "Postgraduate students",
    "Individuals aspiring to careers in sports management or sports science"
  ],
  "_weight": 1
}