{
  "id": 756,
  "name": "Invictus Search",
  "description": "The current operating environment demands agile leaders that not only help your organization survive but thrive. They exhibit agility in terms of introducing new ways of working and pivoting rapidly to new operating models for the business. Crisis tested leaders will develop a tolerance for ambiguity, enhance collaboration and communication across the organization and introduce a culture of constant review, refinement and improvement. Partner with Invictus Search to identify these leaders for your organization.",
  "features": [
    "Global executive search",
    "Leadership assessments",
    "Executive coaching"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Boost Hiring Manager Confidence and Productivity",
    "Hire Top Talent Faster and More Efficiently"
  ],
  "categories": [
    "Recruiting"
  ],
  "sub_categories": [
    "Staffing services providers",
    "HR consulting providers"
  ],
  "tags": [
    "Recruiting",
    "Hiring",
    "Talent sourcing",
    "Recruiting costs"
  ],
  "headquarter": "Singapore",
  "launch_date": "2020",
  "order": 20709,
  "weightage": null,
  "HCM": null,
  "Headline": "TALENT FOR TRANSFORMATION",
  "ProductId": null,
  "ShortDescription": "Invictus Search is a global executive search firm headquartered in Singapore. Run by a seasoned business and Finance leader, we focus on assisting our clients in the Agriculture, Food and FMCG industries to source leaders with a proven track record of delivering value in today's volatile environment",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:33:50.724Z",
  "enhanced_description": "Invictus Search is a global executive search firm headquartered in Singapore, founded in 2020 and led by a seasoned business and Finance leader. They specialize in identifying agile, crisis-tested leaders for organizations, particularly within the Agriculture, Food, and FMCG industries. These leaders are adept at introducing new ways of working, pivoting rapidly to new operating models, enhancing collaboration and communication, and fostering a culture of constant review, refinement, and improvement. Invictus Search aims to help organizations not only survive but thrive in today's volatile environment by sourcing top executive talent and further developing them through leadership assessments and executive coaching services.",
  "target_industries": [
    "Agriculture",
    "Food",
    "FMCG"
  ],
  "key_use_cases": [
    "Sourcing and identifying agile and crisis-tested executive leaders for critical roles",
    "Conducting leadership assessments to evaluate executive potential and fit",
    "Providing executive coaching to enhance leadership capabilities and organizational performance",
    "Boosting hiring manager confidence and productivity in executive recruitment",
    "Accelerating the hiring of top executive talent"
  ],
  "competitive_advantages": [
    "Specialization in identifying agile and crisis-tested executive leaders for transformational roles",
    "Deep expertise and focus within the Agriculture, Food, and FMCG industries",
    "Global executive search capabilities",
    "Comprehensive leadership solutions including executive search, assessments, and coaching",
    "Led by a seasoned business and Finance leader providing unique insight"
  ],
  "hr_functions_supported": [
    "Executive Recruitment",
    "Leadership Development",
    "Talent Sourcing",
    "HR Consulting"
  ],
  "roi_benefits": [
    "Enhanced organizational resilience and growth through agile leadership",
    "Increased efficiency and speed in executive hiring",
    "Improved hiring manager confidence and productivity",
    "Access to top-tier executive talent capable of delivering value in volatile environments"
  ],
  "searchable_keywords": [
    "Invictus Search",
    "executive search",
    "global executive search",
    "leadership assessments",
    "executive coaching",
    "recruiting",
    "hiring",
    "talent sourcing",
    "staffing services",
    "HR consulting",
    "agile leaders",
    "crisis-tested leaders",
    "top talent",
    "organizational transformation",
    "executive recruitment",
    "leadership development",
    "Singapore",
    "Agriculture industry",
    "Food industry",
    "FMCG industry",
    "talent for transformation"
  ],
  "primary_users": [
    "Hiring Managers",
    "HR Leaders",
    "C-suite Executives",
    "Organizational Leaders"
  ],
  "_weight": 1
}