{
  "id": 788,
  "name": "Keep Going Beyond",
  "description": "\"Keep Going Beyond\" is a community of industry professionals and thought leaders who are passionate about driving innovation and progress in the built environment sector. This community is jointly created and managed by Beyond Technologies and Keepital, two companies at the forefront of technology and sustainability solutions. The community is designed to foster collaboration and knowledge-sharing among its members, with a focus on advancing the use of technology in the built environment sector. Through a variety of programs and events, members will have the opportunity to learn from experts, network with peers, and work on projects that drive innovation and progress",
  "features": [
    "Built Environment",
    "Innovation Studio",
    "Community of industry professionals"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Improve Employee Happiness and Engagement"
  ],
  "categories": [
    "Other / technology",
    "Total Rewards"
  ],
  "sub_categories": [
    "Internet of things",
    "Artificial intelligence",
    "Employee recognition software"
  ],
  "tags": [
    "Employee engagement",
    "Employee satisfaction",
    "Employee benefits"
  ],
  "headquarter": "Singapore",
  "launch_date": "2023",
  "order": 20741,
  "weightage": false,
  "HCM": null,
  "Headline": "Move with the BEAT & Keep Going Beyond",
  "ProductId": null,
  "ShortDescription": "\"Keep Going Beyond\" is a community of industry professionals and thought leaders who are passionate about driving innovation and progress in the built environment sector.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [
    {
      "name": "Focus on Advancing Built Environment",
      "sequence": 0,
      "description": "This community is for industry professionals in Asia who are interested in using technology and sustainability to improve the built environment. This suggests a focus on areas like green building, smart cities, and sustainable construction."
    },
    {
      "name": "Networking and Learning Opportunities",
      "sequence": 1,
      "description": "  Keepgoingbeyond offers members access to resources like networking events, seminars, and workshops. This allows professionals to connect with others in the field, learn about new trends, and develop their skills."
    },
    {
      "name": "Collaborative Effort",
      "sequence": 2,
      "description": "The community is managed by Beyond Technologies and Keepital. This collaboration between industry leaders suggests a commitment to fostering innovation and progress in the built environment sector."
    }
  ],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": true,
  "Large_Enterprise": true,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:34:29.638Z",
  "enhanced_description": "\"Keep Going Beyond\" is a community of industry professionals and thought leaders dedicated to driving innovation and progress within the built environment sector. This initiative is a collaborative effort between Beyond Technologies and Keepital, both recognized leaders in technology and sustainability solutions. The community, primarily targeting professionals in Asia, aims to foster collaboration and knowledge-sharing, specifically focusing on the advancement of technology and sustainability applications in areas such as green building, smart cities, and sustainable construction. Through various programs, networking events, seminars, and workshops, members gain opportunities to learn from experts, connect with peers, develop their skills, and contribute to innovative projects.",
  "target_industries": [
    "Built Environment",
    "Green Building",
    "Smart Cities",
    "Sustainable Construction"
  ],
  "ideal_company_sizes": [
    "Global Enterprise",
    "Large Enterprise"
  ],
  "key_use_cases": [
    "Fostering collaboration among industry professionals",
    "Knowledge-sharing and learning about technology in the built environment",
    "Networking with peers and experts in the built environment sector",
    "Professional development and skill enhancement through workshops and seminars",
    "Driving innovation and progress in built environment projects"
  ],
  "competitive_advantages": [
    "Specialized focus on the built environment sector",
    "Community of industry professionals and thought leaders",
    "Jointly managed by leading technology and sustainability companies (Beyond Technologies and Keepital)",
    "Provides access to expert-led learning opportunities (seminars, workshops)",
    "Offers significant networking opportunities within a niche industry"
  ],
  "hr_functions_supported": [
    "Employee Engagement",
    "Learning & Development",
    "Knowledge Management"
  ],
  "technology_stack": [],
  "roi_benefits": [
    "Improved employee happiness and engagement",
    "Enhanced knowledge-sharing and collaboration",
    "Accelerated innovation and progress within the built environment",
    "Professional development and skill enhancement for employees",
    "Expanded professional networks for industry professionals"
  ],
  "searchable_keywords": [
    "Keep Going Beyond",
    "Built Environment",
    "Innovation Studio",
    "Community of industry professionals",
    "Other / technology",
    "Total Rewards",
    "Internet of things",
    "Artificial intelligence",
    "Employee recognition software",
    "Employee engagement",
    "Employee satisfaction",
    "Employee benefits",
    "Move with the BEAT",
    "green building",
    "smart cities",
    "sustainable construction",
    "networking events",
    "seminars",
    "workshops",
    "Beyond Technologies",
    "Keepital",
    "industry professionals Asia"
  ],
  "primary_users": [
    "Industry professionals",
    "Thought leaders",
    "Experts",
    "Peers",
    "Professionals interested in technology and sustainability in the built environment sector (specifically in Asia)"
  ],
  "_weight": 1
}