{
  "id": 808,
  "name": "Lancesoft Indonesia",
  "description": "Established in 2000, LanceSoft is a Certified MBE and Woman-Owned organization, and a pioneer in providing premium end-to-end Global Workforce Solutions and IT Services to diverse clients across various domains. LanceSoft’s mission is to establish global cross-culture human connections that further the careers of our employees and strengthen the businesses of our clients. We are driven to use the power of our global network to connect businesses with the right people, and people with the right businesses without bias. We provide Global Workforce Solutions with a human touch. LanceSoft provides Global Workforce Solutions with a human touch and a comprehensive recruiting organization, addressing the complex workforce challenges your company faces today, from contingent and permanent staffing to talent management, outsourcing, and talent development.",
  "features": [
    "Bridging gaps between Design and implementation",
    "Diversity, Equality, and Inclusivity",
    "We listen to others. We are open to criticism. Meritocracy is designed to produce the best possible decision under any given circumstance by empowering the best thinkers in the company, regardless of position."
  ],
  "founders": [],
  "price": [],
  "business_objectives": [],
  "categories": [
    "Recruiting"
  ],
  "sub_categories": [
    "Staffing & management software",
    "Background check software",
    "Recruitment agencies"
  ],
  "tags": [
    "Recruiting",
    "Hiring",
    "Data-driven hiring",
    "Hiring process optimization"
  ],
  "headquarter": "Jakarta",
  "launch_date": "2000",
  "order": 20761,
  "weightage": false,
  "HCM": null,
  "Headline": "Purpose. People. Performance. Partnerships.",
  "ProductId": null,
  "ShortDescription": "Established in 2000, LanceSoft is a Certified MBE and Woman-Owned organization, and a pioneer in providing premium end-to-end Global Workforce Solutions and IT Services to diverse clients across various domains.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [
    {
      "name": "Global Workforce Solutions Provider",
      "sequence": 0,
      "description": "The article is about a company named LanceSoft. The company describes itself as a provider of Global Workforce Solutions, which means they help connect businesses with the right people and people with the right businesses."
    },
    {
      "name": "Focus on Four Pillars",
      "sequence": 1,
      "description": "To achieve their goal, LanceSoft focuses on four pillars: Purpose, People, Performance, and Partnerships."
    },
    {
      "name": "Connecting Businesses and People",
      "sequence": 2,
      "description": "In essence, LanceSoft acts as a bridge between businesses and people, aiming to find the best fit for both parties."
    }
  ],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": true,
  "Large_Enterprise": true,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:34:51.684Z",
  "enhanced_description": "LanceSoft Indonesia, established in 2000, is a Certified MBE and Woman-Owned organization specializing in providing premium end-to-end Global Workforce Solutions and IT Services. They aim to address complex workforce challenges by connecting businesses with the right people and talent. Their comprehensive services include contingent and permanent staffing, talent management, outsourcing, and talent development. As a recruitment agency, LanceSoft also offers staffing and management software, including background check capabilities, emphasizing a data-driven approach to optimize the hiring process with a focus on diversity, equality, and inclusivity.",
  "ideal_company_sizes": [
    "Global Enterprise",
    "Large Enterprise"
  ],
  "key_use_cases": [
    "Connecting businesses with the right people and talent",
    "Contingent staffing solutions",
    "Permanent staffing solutions",
    "Talent management services",
    "Outsourcing solutions",
    "Talent development programs",
    "Conducting background checks",
    "Optimizing hiring processes",
    "Addressing complex workforce challenges"
  ],
  "competitive_advantages": [
    "Certified MBE and Woman-Owned organization",
    "Pioneer in providing end-to-end Global Workforce Solutions and IT Services since 2000",
    "Emphasis on Diversity, Equality, and Inclusivity in talent connections",
    "Provides 'Global Workforce Solutions with a human touch'",
    "Comprehensive recruiting organization addressing diverse workforce challenges"
  ],
  "hr_functions_supported": [
    "Recruiting",
    "Staffing (Contingent)",
    "Staffing (Permanent)",
    "Talent Management",
    "Talent Development",
    "Outsourcing",
    "Background Checks"
  ],
  "roi_benefits": [
    "Strengthening businesses through effective talent acquisition",
    "Furthering careers of employees by connecting them with suitable roles",
    "Hiring process optimization leading to efficiency",
    "Improved decision-making through data-driven hiring",
    "Bridging gaps between businesses and the right talent"
  ],
  "searchable_keywords": [
    "Lancesoft Indonesia",
    "Global Workforce Solutions",
    "IT Services",
    "Recruiting",
    "Hiring",
    "Staffing",
    "Contingent Staffing",
    "Permanent Staffing",
    "Talent Management",
    "Outsourcing",
    "Talent Development",
    "Background Check Software",
    "Recruitment Agency",
    "Data-driven Hiring",
    "Hiring Process Optimization",
    "Diversity Equality Inclusivity",
    "DEI",
    "MBE Certified",
    "Woman-Owned Business",
    "Enterprise Staffing",
    "Large Enterprise Staffing"
  ],
  "primary_users": [
    "HR Professionals",
    "Hiring Managers",
    "Business Leaders",
    "Company Executives"
  ],
  "_weight": 1
}