{
  "id": 809,
  "name": "LANSIMA",
  "description": "LANSIMA LTD. Established in 1982, and now has become one of the leading Recruitment agency in Indonesia. With several representatives in South East Asia, Middle East; Doha, Dubai, Oman, LANSIMA is currently conducting business with most of Middle East and Asian Member Countries and it poised for even greater expansion in the global market place. In 1990 LANSIMA have develop their institution from just regular manpower supplier into semi skills, skills and highly skills man power provider. With qualified and experienced assessors and trainers, we shall able to contribute best-qualified Indonesian worker to the industries concern that shall matched with the requirement and pre-requirement needed. The head quarters of LANSIMA activities is in Jakarta, Indonesia, while the Office Branches, training and education centers are scattered all across the Country",
  "features": [
    "Local Recruitment Support",
    "Legal Document Process",
    "Consultation, and Expatriation Support"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Hire Top Talent Faster and More Efficiently"
  ],
  "categories": [
    "Recruiting"
  ],
  "sub_categories": [
    "Staffing & management software",
    "Background check software",
    "Recruitment agencies",
    "Recruiting software"
  ],
  "tags": [
    "Recruiting",
    "Hiring",
    "Data-driven hiring",
    "Hiring process optimization",
    "Hiring efficiency",
    "Talent acquisition"
  ],
  "headquarter": "Jakarta Selatan, Jakarta",
  "launch_date": "1982",
  "order": 20762,
  "weightage": false,
  "HCM": null,
  "Headline": "Find Great Candidates, Fast With Lansima",
  "ProductId": null,
  "ShortDescription": "LANSIMA LTD. Established in 1982, and now has become one of the leading Recruitment agency in Indonesia.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [
    {
      "name": "LANSIMA: A Leading Recruitment Agency in Indonesia",
      "sequence": 0,
      "description": "The article positions LANSIMA Ltd as a top recruitment agency in Indonesia. They offer a variety of recruitment services including domestic and international placements, and workforce training."
    },
    {
      "name": "Services Offered",
      "sequence": 1,
      "description": "LANSIMA offers a comprehensive suite of recruitment services including local and international recruitment, and labor training. This one-stop-shop approach can streamline the hiring process for businesse"
    },
    {
      "name": "Career Resources",
      "sequence": 2,
      "description": "The company maintains a blog with career advice and news articles. This can be a valuable resource for job seekers and those looking to stay up-to-date on industry trends."
    }
  ],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": true,
  "Large_Enterprise": true,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:34:53.151Z",
  "enhanced_description": "LANSIMA, established in 1982, is a leading recruitment agency based in Indonesia. With an extensive network that includes representatives in Southeast Asia (e.g., Singapore, Malaysia) and the Middle East (Doha, Dubai, Oman), and operations spanning most Middle East and Asian Member Countries, LANSIMA is poised for further global expansion. The agency evolved from a general manpower supplier to a specialized provider of semi-skilled, skilled, and highly-skilled manpower, ensuring talent quality through qualified assessors and trainers who precisely match candidates to specific industry requirements. LANSIMA offers a comprehensive suite of recruitment services, including local recruitment support, international placements, legal document processing, and expatriation assistance. Headquartered in Jakarta, Indonesia, with numerous office branches, training, and education centers across the country, LANSIMA aims to help large and global enterprises hire top talent faster and more efficiently. The company also provides valuable career resources through its blog, benefiting job seekers and industry professionals.",
  "ideal_company_sizes": [
    "Large_Enterprise",
    "Global_Enterprise"
  ],
  "key_use_cases": [
    "Hiring top talent globally and locally",
    "Sourcing specialized talent across various skill levels (semi-skilled, skilled, highly-skilled)",
    "Managing legal documentation for international hires and expatriation",
    "Obtaining consultation and support for international recruitment processes",
    "Accessing pre-qualified and pre-trained workforce"
  ],
  "competitive_advantages": [
    "Extensive experience and long-standing reputation (established 1982)",
    "Wide international reach and presence in Southeast Asia and Middle East",
    "Comprehensive 'one-stop-shop' recruitment services, including legal and expatriation support",
    "Specialization in providing specific skill levels of manpower (semi-skilled, skilled, highly-skilled)",
    "Quality assurance through qualified assessors and trainers for candidate matching",
    "Ability to streamline the hiring process for businesses"
  ],
  "hr_functions_supported": [
    "Talent Acquisition",
    "Recruitment",
    "Workforce Planning",
    "Onboarding (specifically for international placements via legal and expatriation support)",
    "Training & Development (pre-placement training)"
  ],
  "roi_benefits": [
    "Faster and more efficient talent acquisition",
    "Access to a pool of best-qualified and experienced Indonesian workers",
    "Reduced administrative burden and risk associated with legal documentation for international hires",
    "Streamlined hiring process through a comprehensive service offering"
  ],
  "searchable_keywords": [
    "LANSIMA",
    "Recruiting",
    "Hiring",
    "Talent Acquisition",
    "Recruitment Agency",
    "Staffing Agency",
    "Manpower Provider",
    "Indonesia Recruitment",
    "International Recruitment",
    "Expatriation Support",
    "Legal Document Process",
    "Recruitment Consultation",
    "Skilled Manpower",
    "Semi-skilled Manpower",
    "Highly-skilled Manpower",
    "Workforce Training",
    "Global Recruitment",
    "Middle East Recruitment",
    "Asia Recruitment",
    "HR Services",
    "Talent Sourcing",
    "Hiring Efficiency",
    "Hiring Process Optimization",
    "Candidate Sourcing",
    "Recruitment Services"
  ],
  "primary_users": [
    "Companies",
    "Businesses (specifically Large and Global Enterprises)",
    "HR Departments",
    "Talent Acquisition Teams"
  ],
  "compliance_features": [
    "Legal Document Process (for recruitment and expatriation)"
  ],
  "_weight": 1
}