{
  "id": 847,
  "name": "Lugiámi",
  "description": "Lugiámi is a global esports brand on a mission to provide resources and opportunities for female gamers to flourish and thrive! We are passionately committed to building THE female esports community, and rely on a simple but winning philosophy - focus on cultivating the positive culture that is critical to success in team-based esports. Lugiámi drives forward this philosophy by providing advertising and promotional sponsorship, talent and team development, business management, coaching, and support to players both professional and aspiring, who compete in esports.",
  "features": [
    "An online platform that provides a safe space for all female gamers to gather and improve their gameplays",
    "We set out to create an agency",
    "Support in digital marketing"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Total Rewards",
    "Other / technology"
  ],
  "sub_categories": [
    "Benefits administration software",
    "Internet of things"
  ],
  "tags": [
    "Skill development",
    "Skill acquisition"
  ],
  "headquarter": "Singapore",
  "launch_date": "2021",
  "order": 20800,
  "weightage": false,
  "HCM": null,
  "Headline": "On a mission to build a safe space and bring more opportunities to female gamers around the globe.",
  "ProductId": null,
  "ShortDescription": "Lugiámi is a global esports brand on a mission to provide resources and opportunities for female gamers to flourish and thrive!",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [
    {
      "name": "Online Platform",
      "sequence": 0,
      "description": "An online platform that provides a safe space forall female gamers to gather and improve their gameplays"
    },
    {
      "name": "Awesome Execution",
      "sequence": 1,
      "description": "Your digital marketing has a lot of moving pieces. We can help tackle website projects, produce beautiful video and graphic content."
    }
  ],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": true,
  "Large_Enterprise": true,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:35:36.319Z",
  "enhanced_description": "Lugiámi is a global esports brand dedicated to empowering female gamers by providing resources and opportunities for them to flourish and thrive. It aims to build the premier female esports community, fostering a positive culture critical for success in team-based esports. Lugiámi achieves this by offering services such as advertising and promotional sponsorship, talent and team development, business management, coaching, and comprehensive support to both professional and aspiring esports players. The brand operates an online platform designed as a safe space for female gamers to gather and enhance their gameplay, also providing extensive support in digital marketing, including website projects, video, and graphic content production.",
  "target_industries": [
    "Esports",
    "Gaming"
  ],
  "ideal_company_sizes": [
    "Large enterprise",
    "Global enterprise"
  ],
  "key_use_cases": [
    "Providing resources and opportunities for female gamers",
    "Building a female esports community",
    "Cultivating positive culture in team-based esports environments",
    "Offering advertising and promotional sponsorship for esports talent",
    "Developing talent and teams for esports players",
    "Providing business management for esports players and teams",
    "Coaching professional and aspiring esports players",
    "Supporting digital marketing efforts, including website projects, video, and graphic content creation",
    "Providing an online platform for female gamers to gather and improve gameplay"
  ],
  "competitive_advantages": [
    "Dedicated focus on female gamers and building a female esports community",
    "Emphasis on cultivating a positive culture within team-based esports",
    "Comprehensive support model covering talent development, business management, and digital marketing for esports players"
  ],
  "hr_functions_supported": [
    "Talent development",
    "Learning and development",
    "Benefits administration"
  ],
  "roi_benefits": [
    "Accelerated skill development",
    "Improved learning efficiency"
  ],
  "searchable_keywords": [
    "Lugiámi",
    "Esports",
    "Female gamers",
    "Gaming community",
    "Skill development",
    "Skill acquisition",
    "Talent development",
    "Coaching",
    "Digital marketing",
    "Online platform",
    "Sponsorship",
    "Business management",
    "Team development",
    "Female esports",
    "Safe space"
  ],
  "primary_users": [
    "Female gamers (professional and aspiring)",
    "Esports teams"
  ],
  "deployment_options": [
    "Cloud-based"
  ],
  "_weight": 1
}