{
  "id": 874,
  "name": "Michael Page",
  "description": "Since our start as a two-man operation in London in 1976, Michael Page has grown and expanded globally. Now, after more than 40 years in the recruitment market, we have secured our position as leaders in international recruitment and hiring. We currently have 139 offices that create a network that spans 37 countries around the world, with strong opportunities for more growth within Asia Pacific. We opened our first office in Asia in 1994, and have developed our presence into many of the main business hubs in the region since then. Our team in Asia has global connections, regional knowledge and local market experience; ideally positioning us to partner with multinational blue-chip companies and local firms alike, and with today’s global professionals. Over time, our founding mission has remained unchanged: to bring the world’s best companies and brightest professionals together, helping each side reach their maximum potential and capabilities. We offer a unique, consultative approach to recruitment, tailoring every solution to specific requirements and offering long-term support. Through experience, growth and consistently high standards, we have become one of the most recognised and respected recruitment brands in the world.",
  "features": [
    "GUidance to clear and transparent carrerr journey",
    "Searching opputunities for the individual needs",
    "Diversed and Inclusive solutions"
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Hire Top Talent Faster and More Efficiently"
  ],
  "categories": [
    "Recruiting",
    "Other / technology"
  ],
  "sub_categories": [
    "Job boards",
    "Recruitment marketing platforms"
  ],
  "tags": [
    "Hiring Speed",
    "Hiring efficiency",
    "Recruiting efficiency"
  ],
  "headquarter": "Addlestone, Weybridge",
  "launch_date": "1976",
  "order": 20827,
  "weightage": false,
  "HCM": null,
  "Headline": "Connecting the world's brightest professionals and leading brands",
  "ProductId": null,
  "ShortDescription": "Michael Page has five decades of expertise in professional services recruitment. We were established in London in 1976, and over this period we've grown organically to become one of the best-known and most respected consultancies, with an office network spanning six continents.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [
    {
      "name": "Services Offered",
      "sequence": 0,
      "description": "The company offers a variety of recruitment services including executive search, professional clerical and support, and outsourcing."
    },
    {
      "name": "Global Reach",
      "sequence": 1,
      "description": "PageGroup helps both employers and employees find the right job. They operate in 37 countries around the world."
    }
  ],
  "Approved": null,
  "Claimed": true,
  "Demo_Available": false,
  "Global_Enterprise": true,
  "Large_Enterprise": true,
  "Small_Enterprise": true,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:36:07.434Z",
  "enhanced_description": "Michael Page, established in London in 1976, has evolved into a global leader in international recruitment and hiring with over 40 years of experience, specializing in professional services. They operate a network of 139 offices across 37 countries, connecting the world's brightest professionals with leading brands, including multinational blue-chip companies and local firms. Michael Page offers a unique, consultative approach to recruitment, tailoring solutions to specific requirements and providing long-term support to both employers and candidates. Their services include executive search, professional, clerical, and support recruitment, and recruitment process outsourcing (RPO). They are committed to providing guidance for transparent career journeys, personalized job opportunities, and delivering diverse and inclusive solutions, aiming to help companies hire top talent faster and more efficiently.",
  "target_industries": [
    "Professional Services"
  ],
  "ideal_company_sizes": [
    "Small Enterprise",
    "Large Enterprise",
    "Global Enterprise"
  ],
  "key_use_cases": [
    "Talent acquisition",
    "Executive search",
    "Professional and clerical recruitment",
    "Recruitment process outsourcing (RPO)",
    "Career guidance for professionals",
    "Personalized job matching",
    "Diversity and Inclusion recruitment",
    "Job board services",
    "Recruitment marketing",
    "Optimizing hiring speed and efficiency"
  ],
  "competitive_advantages": [
    "Extensive global reach with 139 offices across 37 countries",
    "Over 40 years of experience in the recruitment market",
    "Consultative approach to recruitment with tailored solutions",
    "Provision of long-term support",
    "Strong brand recognition and respect in the industry",
    "Deep regional and local market knowledge",
    "Focus on diverse and inclusive recruitment solutions",
    "Supports both employers and employees"
  ],
  "hr_functions_supported": [
    "Talent Acquisition",
    "Recruitment Process Outsourcing (RPO)",
    "Diversity & Inclusion (D&I) Recruitment",
    "Candidate Experience"
  ],
  "roi_benefits": [
    "Faster talent acquisition",
    "Improved hiring efficiency",
    "Access to top talent"
  ],
  "searchable_keywords": [
    "Michael Page",
    "Recruitment",
    "Hiring",
    "International Recruitment",
    "Global Recruitment",
    "Talent Acquisition",
    "Executive Search",
    "Professional Services Recruitment",
    "Clerical Recruitment",
    "Support Recruitment",
    "Recruitment Process Outsourcing",
    "RPO",
    "Job Board",
    "Recruitment Marketing",
    "Consultative Recruitment",
    "Career Guidance",
    "Job Search",
    "Diversity Recruitment",
    "Inclusion Recruitment",
    "D&I Solutions",
    "Hiring Speed",
    "Hiring Efficiency",
    "Recruiting Efficiency",
    "HR Consultancy"
  ],
  "primary_users": [
    "Employers",
    "HR Professionals",
    "Hiring Managers",
    "Job Seekers",
    "Candidates"
  ],
  "scalability_features": [
    "Extensive global office network supporting various company sizes (Small to Global Enterprise)"
  ],
  "_weight": 1
}