{
  "id": 970,
  "name": "Pateron Indonesia",
  "description": "Pateron is an edutech startup that provides new learning experiences that are efficient and effective so that students don't spend a lot of time learning. Pateron provides online try outs, learning training and student competitions. Pateron has been trusted by hundreds of thousands of students throughout Indonesia. Pateron has won various awards and is currently being incubated by LPIK and The Greater Hub ITB.",
  "features": [
    "Competition in the field of scientific work intended for high school students and college students on a national scale. Create your best scientific work and win various attractive prizes from Pateron   ",
    "Competitions in the field of art with competitions such as Poetry, Short Stories, Posters, Drawing, and Videocreative. Anyone can enter this competition and show that you are the best in art.",
    "Competition in the field of business is intended for high school students and college students on a national scale. Make your business plan the best you can and win various attractive prizes from Pateron."
  ],
  "founders": [],
  "price": [],
  "business_objectives": [
    "Accelerate Skill Development and Learning Efficiency"
  ],
  "categories": [
    "Learning and Development"
  ],
  "sub_categories": [
    "Training eLearning software",
    "Course authoring",
    "Training & development companies"
  ],
  "tags": [
    "Skill development",
    "Skill acquisition",
    "Continuous learning",
    "Learning optimisation"
  ],
  "headquarter": "Indonesia",
  "launch_date": "2021",
  "order": 20917,
  "weightage": null,
  "HCM": null,
  "Headline": "Pateron providing quality, creativity and technology-based learning guidance",
  "ProductId": null,
  "ShortDescription": "Pateron providing quality, creativity and technology-based learning guidance and training in creating quity and improving the quality of education in Indonesia by Creating a learning ecosystem using then community learning model and Streamlining the learning process through the optimal use of study planners.",
  "Company": [],
  "CrossSells": [],
  "DemoDetails": {
    "title": "",
    "videos": []
  },
  "HCM_INTEGRATION": [],
  "Highlights": [],
  "Approved": false,
  "Claimed": false,
  "Demo_Available": false,
  "Global_Enterprise": false,
  "Large_Enterprise": false,
  "Small_Enterprise": false,
  "Main_Home": null,
  "Most_Searched": false,
  "New_Arrival": false,
  "Normal": true,
  "Pricing_Available": false,
  "Saved": false,
  "Sponsored": false,
  "Spotlight": false,
  "PublishedAt": "2024-02-28T06:37:56.200Z",
  "enhanced_description": "Pateron Indonesia is an award-winning edutech startup incubated by LPIK and The Greater Hub ITB, dedicated to providing quality, creativity, and technology-based learning guidance. The platform focuses on accelerating skill development and improving learning efficiency, ensuring students don't spend excessive time on learning. It offers a comprehensive learning ecosystem through online try-outs, learning training, and various student competitions (scientific work, art, and business) on a national scale. Pateron aims to streamline the learning process via optimal use of study planners and a community learning model, and has gained the trust of hundreds of thousands of students across Indonesia.",
  "key_use_cases": [
    "Online try-outs for academic assessment",
    "Structured learning training",
    "Skill development through national-scale competitions (scientific work, art, business)",
    "Efficient learning management via study planners",
    "Community-based learning and collaboration"
  ],
  "competitive_advantages": [
    "Provides efficient and effective learning experiences, saving students time",
    "Trusted by hundreds of thousands of students throughout Indonesia",
    "Recipient of various awards",
    "Incubated by reputable institutions (LPIK and The Greater Hub ITB)",
    "Offers a unique blend of online try-outs, training, and diverse student competitions",
    "Utilizes a community learning model",
    "Focuses on optimal use of study planners for streamlined learning"
  ],
  "roi_benefits": [
    "Accelerated skill development for students",
    "Improved learning efficiency",
    "Streamlined learning process",
    "Enhanced quality of education"
  ],
  "searchable_keywords": [
    "Pateron",
    "Indonesia",
    "edutech",
    "learning experiences",
    "online try outs",
    "learning training",
    "student competitions",
    "skill development",
    "skill acquisition",
    "learning efficiency",
    "continuous learning",
    "learning optimisation",
    "study planners",
    "community learning model",
    "education quality",
    "scientific work competition",
    "art competition",
    "business competition",
    "high school students",
    "college students",
    "Learning and Development",
    "Training eLearning software",
    "Course authoring"
  ],
  "primary_users": [
    "Students",
    "High school students",
    "College students"
  ],
  "_weight": 1
}